module @SyncTensorsGraph.762 attributes {mhlo.cross_program_prefetches = [], mhlo.input_output_alias = [], mhlo.is_dynamic = false, mhlo.use_auto_spmd_partitioning = false} {
  sdy.mesh @mesh = <["_axis_0"=2, "_axis_1"=4]>
  func.func @main(%arg0: tensor<4x64x512xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{"_axis_0"}, {}, {}]>, ttcore.argument_type = #ttcore.argument_type<input>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<2x64x512xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "kv_cache"}, %arg1: tensor<576x2048xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {"_axis_0"}]>, ttcore.argument_type = #ttcore.argument_type<parameter>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<576x1024xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "wkv_a.weight"}, %arg2: tensor<4x1x2048xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>, ttcore.argument_type = #ttcore.argument_type<input>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<4x1x2048xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "args_0"}, %arg3: tensor<512xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>, ttcore.argument_type = #ttcore.argument_type<parameter>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<512xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "kv_norm.weight"}, %arg4: tensor<i1> {sdy.sharding = #sdy.sharding<@mesh, []>, ttcore.argument_type = #ttcore.argument_type<input>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<i1>>, ttcore.shard_status = #ttcore.shard_status<presharded>}, %arg5: tensor<4x64x64xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{"_axis_0"}, {}, {}]>, ttcore.argument_type = #ttcore.argument_type<input>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<2x64x64xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "pe_cache"}, %arg6: tensor<1x32x2xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>, ttcore.argument_type = #ttcore.argument_type<input>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<1x32x2xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "args_1"}, %arg7: tensor<4x64x128xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{"_axis_0"}, {}, {}]>, ttcore.argument_type = #ttcore.argument_type<input>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<2x64x128xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "indexer.k_cache"}, %arg8: tensor<128x128xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>, ttcore.argument_type = #ttcore.argument_type<constant>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<128x128xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "indexer.haddamard"}, %arg9: tensor<128xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>, ttcore.argument_type = #ttcore.argument_type<parameter>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<128xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "indexer.k_norm.bias"}, %arg10: tensor<128xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>, ttcore.argument_type = #ttcore.argument_type<parameter>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<128xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "indexer.k_norm.weight"}, %arg11: tensor<128x2048xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {"_axis_0"}]>, ttcore.argument_type = #ttcore.argument_type<parameter>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<128x1024xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "indexer.wk.weight"}, %arg12: tensor<2048x2048xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{"_axis_0"}, {"_axis_1"}]>, ttcore.argument_type = #ttcore.argument_type<parameter>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<1024x512xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "wo.weight"}, %arg13: tensor<4096x512xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{"_axis_1"}, {}]>, ttcore.argument_type = #ttcore.argument_type<parameter>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<1024x512xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "wkv_b.weight"}, %arg14: tensor<64x2048xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{"_axis_1"}, {"_axis_0"}]>, ttcore.argument_type = #ttcore.argument_type<parameter>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<16x1024xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "indexer.weights_proj.weight"}, %arg15: tensor<8192x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{"_axis_1"}, {}]>, ttcore.argument_type = #ttcore.argument_type<parameter>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<2048x3072xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "indexer.wq_b.weight"}, %arg16: tensor<3072x2048xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {"_axis_0"}]>, ttcore.argument_type = #ttcore.argument_type<parameter>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<3072x1024xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "wq_a.weight"}, %arg17: tensor<3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>, ttcore.argument_type = #ttcore.argument_type<parameter>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<3072xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "q_norm.weight"}, %arg18: tensor<3072x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{"_axis_1"}, {}]>, ttcore.argument_type = #ttcore.argument_type<parameter>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<768x3072xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>, ttir.name = "wq_b.weight"}) -> (tensor<4x64x512xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{"_axis_0", ?}, {?}, {?}]>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<2x64x512xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>}, tensor<4x64x64xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{"_axis_0", ?}, {?}, {?}]>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<2x64x64xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>}, tensor<4x64x128xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{"_axis_0", ?}, {?}, {?}]>, ttcore.local_shape = #ttcore<local_shape local_shape = tensor<2x64x128xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>}, tensor<4x1x2048xbf16> {ttcore.local_shape = #ttcore<local_shape local_shape = tensor<4x1x2048xbf16>>, ttcore.shard_status = #ttcore.shard_status<presharded>}) {
    %0:4 = sdy.manual_computation(%arg0, %arg1, %arg2, %arg3, %arg4, %arg5, %arg6, %arg7, %arg8, %arg9, %arg10, %arg11, %arg12, %arg13, %arg14, %arg15, %arg16, %arg17, %arg18) in_shardings=[<@mesh, [{"_axis_0"}, {}, {}]>, <@mesh, [{}, {"_axis_0"}]>, <@mesh, [{}, {}, {}]>, <@mesh, [{}]>, <@mesh, []>, <@mesh, [{"_axis_0"}, {}, {}]>, <@mesh, [{}, {}, {}]>, <@mesh, [{"_axis_0"}, {}, {}]>, <@mesh, [{}, {}]>, <@mesh, [{}]>, <@mesh, [{}]>, <@mesh, [{}, {"_axis_0"}]>, <@mesh, [{"_axis_0"}, {"_axis_1"}]>, <@mesh, [{"_axis_1"}, {}]>, <@mesh, [{"_axis_1"}, {"_axis_0"}]>, <@mesh, [{"_axis_1"}, {}]>, <@mesh, [{}, {"_axis_0"}]>, <@mesh, [{}]>, <@mesh, [{"_axis_1"}, {}]>] out_shardings=[<@mesh, [{"_axis_0", ?}, {?}, {?}]>, <@mesh, [{"_axis_0", ?}, {?}, {?}]>, <@mesh, [{"_axis_0", ?}, {?}, {?}]>, <@mesh, [{?}, {?}, {?}]>] manual_axes={} (%arg19: tensor<4x64x512xbf16>, %arg20: tensor<576x2048xbf16>, %arg21: tensor<4x1x2048xbf16>, %arg22: tensor<512xbf16>, %arg23: tensor<i1>, %arg24: tensor<4x64x64xbf16>, %arg25: tensor<1x32x2xbf16>, %arg26: tensor<4x64x128xbf16>, %arg27: tensor<128x128xbf16>, %arg28: tensor<128xbf16>, %arg29: tensor<128xbf16>, %arg30: tensor<128x2048xbf16>, %arg31: tensor<2048x2048xbf16>, %arg32: tensor<4096x512xbf16>, %arg33: tensor<64x2048xbf16>, %arg34: tensor<8192x3072xbf16>, %arg35: tensor<3072x2048xbf16>, %arg36: tensor<3072xbf16>, %arg37: tensor<3072x3072xbf16>) {
      %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32>
      %cst_0 = stablehlo.constant dense<0xFF80> : tensor<bf16>
      %c = stablehlo.constant dense<[false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true]> : tensor<64xi1>
      %c_1 = stablehlo.constant dense<[true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]> : tensor<64xi1>
      %cst_2 = stablehlo.constant {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} dense<9.99999997E-7> : tensor<4x1x1xf32>
      %c_3 = stablehlo.constant dense<0> : tensor<i64>
      %cst_4 = stablehlo.constant dense<[-3.200000e+01, -3.100000e+01, -3.000000e+01, -2.900000e+01, -2.800000e+01, -2.700000e+01, -2.600000e+01, -2.500000e+01, -2.400000e+01, -2.300000e+01, -2.200000e+01, -2.100000e+01, -2.000000e+01, -1.900000e+01, -1.800000e+01, -1.700000e+01, -1.600000e+01, -1.500000e+01, -1.400000e+01, -1.300000e+01, -1.200000e+01, -1.100000e+01, -1.000000e+01, -9.000000e+00, -8.000000e+00, -7.000000e+00, -6.000000e+00, -5.000000e+00, -4.000000e+00, -3.000000e+00, -2.000000e+00, -1.000000e+00, 0.000000e+00, 1.000000e+00, 2.000000e+00, 3.000000e+00, 4.000000e+00, 5.000000e+00, 6.000000e+00, 7.000000e+00, 8.000000e+00, 9.000000e+00, 1.000000e+01, 1.100000e+01, 1.200000e+01, 1.300000e+01, 1.400000e+01, 1.500000e+01, 1.600000e+01, 1.700000e+01, 1.800000e+01, 1.900000e+01, 2.000000e+01, 2.100000e+01, 2.200000e+01, 2.300000e+01, 2.400000e+01, 2.500000e+01, 2.600000e+01, 2.700000e+01, 2.800000e+01, 2.900000e+01, 3.000000e+01, 3.100000e+01]> : tensor<64xf32>
      %c_5 = stablehlo.constant dense<1> : tensor<i64>
      %cst_6 = stablehlo.constant {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} dense<3.25520843E-4> : tensor<4x1xf32>
      %cst_7 = stablehlo.constant dense<1.250000e-01> : tensor<bf16>
      %cst_8 = stablehlo.constant dense<8.837890e-02> : tensor<bf16>
      %cst_9 = stablehlo.constant dense<2.000000e+00> : tensor<f32>
      %cst_10 = stablehlo.constant {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} dense<0.001953125> : tensor<4x1xf32>
      %cst_11 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
      %cst_12 = stablehlo.constant dense<7.226560e-02> : tensor<bf16>
      %1 = stablehlo.broadcast_in_dim %cst_12, dims = [] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<bf16>) -> tensor<4x1x16x33xbf16>
      %2 = stablehlo.broadcast_in_dim %cst_11, dims = [] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<bf16>) -> tensor<4x64x64xbf16>
      %3 = stablehlo.broadcast_in_dim %cst_9, dims = [] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<f32>) -> tensor<4x1x512xf32>
      %4 = stablehlo.broadcast_in_dim %cst_11, dims = [] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<bf16>) -> tensor<4x64x512xbf16>
      %5 = stablehlo.broadcast_in_dim %cst_8, dims = [] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<bf16>) -> tensor<4x1x64x1xbf16>
      %6 = stablehlo.broadcast_in_dim %cst_7, dims = [] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}]>]>} : (tensor<bf16>) -> tensor<4x1x64xbf16>
      %7 = stablehlo.broadcast_in_dim %cst_11, dims = [] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}]>]>} : (tensor<bf16>) -> tensor<4x33x64xbf16>
      %8 = stablehlo.broadcast_in_dim %cst_9, dims = [] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<f32>) -> tensor<4x1x3072xf32>
      %9 = stablehlo.broadcast_in_dim %c_5, dims = [] : (tensor<i64>) -> tensor<64xi64>
      %10 = stablehlo.broadcast_in_dim %c_3, dims = [] : (tensor<i64>) -> tensor<64xi64>
      %11 = stablehlo.broadcast_in_dim %cst_11, dims = [] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<bf16>) -> tensor<4x64x128xbf16>
      %12 = stablehlo.broadcast_in_dim %arg23, dims = [] : (tensor<i1>) -> tensor<64xi1>
      %13 = stablehlo.and %12, %c : tensor<64xi1>
      %14 = stablehlo.and %13, %c_1 : tensor<64xi1>
      %15 = stablehlo.reshape %14 : (tensor<64xi1>) -> tensor<1x64x1xi1>
      %16 = stablehlo.broadcast_in_dim %14, dims = [1] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<64xi1>) -> tensor<4x64x128xi1>
      %17 = stablehlo.not %15 : tensor<1x64x1xi1>
      %18 = stablehlo.reshape %17 : (tensor<1x64x1xi1>) -> tensor<64xi1>
      %19 = stablehlo.broadcast_in_dim %18, dims = [1] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<64xi1>) -> tensor<4x64x128xi1>
      %20 = sdy.all_slice [{"_axis_0"}, {}, {}] %arg21 out_sharding=<@mesh, [{"_axis_0"}, {}, {}]> : tensor<4x1x2048xbf16>
      %21 = stablehlo.reshape %20 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : (tensor<4x1x2048xbf16>) -> tensor<4x2048xbf16>
      %22 = stablehlo.reshape %arg30 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {?}, {"_axis_0", ?}]>]>} : (tensor<128x2048xbf16>) -> tensor<1x128x2048xbf16>
      %23 = stablehlo.reshape %22 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {"_axis_0", ?}]>]>} : (tensor<1x128x2048xbf16>) -> tensor<128x2048xbf16>
      %24 = stablehlo.transpose %23, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>, xla_shape = "bf16[2048,128]{0,1}"} : (tensor<128x2048xbf16>) -> tensor<2048x128xbf16>
      %25 = sdy.all_to_all [{"_axis_0"}: 0->1] %21 out_sharding=<@mesh, [{}, {"_axis_0"}]> : tensor<4x2048xbf16>
      %26 = stablehlo.dot_general %25, %24, contracting_dims = [1] x [0] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {?}]>]>} : (tensor<4x2048xbf16>, tensor<2048x128xbf16>) -> tensor<4x128xbf16>
      %27 = sdy.reduce_scatter [{"_axis_0"}, {}] %26 out_sharding=<@mesh, [{"_axis_0"}, {}]> : tensor<4x128xbf16>
      %28 = stablehlo.reshape %27 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x128xbf16>) -> tensor<4x1x128xbf16>
      %29 = stablehlo.reshape %arg29 : (tensor<128xbf16>) -> tensor<1x1x128xbf16>
      %30 = stablehlo.reshape %29 : (tensor<1x1x128xbf16>) -> tensor<128xbf16>
      %31 = stablehlo.reshape %arg28 : (tensor<128xbf16>) -> tensor<1x1x128xbf16>
      %32 = stablehlo.reshape %31 : (tensor<1x1x128xbf16>) -> tensor<128xbf16>
      %cst_13 = stablehlo.constant {reoutline.comp_attrs = {epsilon = 9.99999997E-7 : f32, normalized_shape = dense<128> : tensor<1xi64>}, reoutline.group = "composite_tenstorrent.layer_norm.impl", reoutline.orig_name = "tenstorrent.layer_norm", reoutline.seed, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} dense<9.99999997E-7> : tensor<4x1x1xf32>
      %cst_14 = stablehlo.constant {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} dense<7.812500e-03> : tensor<4x1xf32>
      %cst_15 = stablehlo.constant {reoutline.group = "composite_tenstorrent.layer_norm.impl"} dense<0.000000e+00> : tensor<f32>
      %33 = stablehlo.convert %28 {reoutline.arg_operand_indices = array<i64: 0>, reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x128xbf16>) -> tensor<4x1x128xf32>
      %34 = stablehlo.reduce(%33 init: %cst_15) applies stablehlo.add across dimensions = [2] {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : (tensor<4x1x128xf32>, tensor<f32>) -> tensor<4x1xf32>
      %35 = stablehlo.multiply %34, %cst_14 {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : tensor<4x1xf32>
      %36 = stablehlo.broadcast_in_dim %35, dims = [0, 1] {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1xf32>) -> tensor<4x1x128xf32>
      %37 = stablehlo.subtract %33, %36 {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x128xf32>
      %38 = stablehlo.multiply %37, %37 {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x128xf32>
      %39 = stablehlo.reduce(%38 init: %cst_15) applies stablehlo.add across dimensions = [2] {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : (tensor<4x1x128xf32>, tensor<f32>) -> tensor<4x1xf32>
      %40 = stablehlo.multiply %39, %cst_14 {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : tensor<4x1xf32>
      %41 = stablehlo.reshape %40 {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1xf32>) -> tensor<4x1x1xf32>
      %42 = stablehlo.add %41, %cst_13 {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x1xf32>
      %43 = stablehlo.rsqrt %42 {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x1xf32>
      %44 = stablehlo.reshape %43 {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : (tensor<4x1x1xf32>) -> tensor<4x1xf32>
      %45 = stablehlo.broadcast_in_dim %44, dims = [0, 1] {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1xf32>) -> tensor<4x1x128xf32>
      %46 = stablehlo.multiply %37, %45 {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x128xf32>
      %47 = stablehlo.convert %30 {reoutline.arg_operand_indices = array<i64: 1>, reoutline.group = "composite_tenstorrent.layer_norm.impl"} : (tensor<128xbf16>) -> tensor<128xf32>
      %48 = stablehlo.broadcast_in_dim %47, dims = [2] {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<128xf32>) -> tensor<4x1x128xf32>
      %49 = stablehlo.multiply %46, %48 {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x128xf32>
      %50 = stablehlo.convert %32 {reoutline.arg_operand_indices = array<i64: 2>, reoutline.group = "composite_tenstorrent.layer_norm.impl"} : (tensor<128xbf16>) -> tensor<128xf32>
      %51 = stablehlo.broadcast_in_dim %50, dims = [2] {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<128xf32>) -> tensor<4x1x128xf32>
      %52 = stablehlo.add %49, %51 {reoutline.group = "composite_tenstorrent.layer_norm.impl", sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x128xf32>
      %53 = stablehlo.convert %52 {reoutline.group = "composite_tenstorrent.layer_norm.impl", reoutline.result_pos = array<i64: 0>, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x128xf32>) -> tensor<4x1x128xbf16>
      %54 = stablehlo.slice %53 [0:4, 0:1, 0:64] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x128xbf16>) -> tensor<4x1x64xbf16>
      %55 = stablehlo.reshape %54 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}, {?}]>]>} : (tensor<4x1x64xbf16>) -> tensor<4x1x1x2x32xbf16>
      %56 = stablehlo.transpose %55, dims = [0, 1, 2, 4, 3] {result_layout = dense<[3, 4, 2, 1, 0]> : tensor<5xindex>, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}, {?}]>]>, xla_shape = "bf16[4,1,1,32,2]{3,4,2,1,0}"} : (tensor<4x1x1x2x32xbf16>) -> tensor<4x1x1x32x2xbf16>
      %57 = stablehlo.convert %56 {result_layout = dense<[3, 4, 2, 1, 0]> : tensor<5xindex>, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}, {?}]>]>, xla_shape = "f32[4,1,1,32,2]{3,4,2,1,0}"} : (tensor<4x1x1x32x2xbf16>) -> tensor<4x1x1x32x2xf32>
      %58 = stablehlo.slice %57 [0:4, 0:1, 0:1, 0:32, 0:1] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32x2xf32>) -> tensor<4x1x1x32x1xf32>
      %59 = stablehlo.reshape %58 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32x1xf32>) -> tensor<4x1x1x32xf32>
      %60 = stablehlo.reshape %arg25 : (tensor<1x32x2xbf16>) -> tensor<1x1x1x32x2xbf16>
      %61 = stablehlo.slice %60 [0:1, 0:1, 0:1, 0:32, 0:1] : (tensor<1x1x1x32x2xbf16>) -> tensor<1x1x1x32x1xbf16>
      %62 = stablehlo.reshape %61 : (tensor<1x1x1x32x1xbf16>) -> tensor<1x1x1x32xbf16>
      %63 = stablehlo.convert %62 : (tensor<1x1x1x32xbf16>) -> tensor<1x1x1x32xf32>
      %64 = stablehlo.reshape %63 : (tensor<1x1x1x32xf32>) -> tensor<1x1x32xf32>
      %65 = stablehlo.broadcast_in_dim %64, dims = [1, 2, 3] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<1x1x32xf32>) -> tensor<4x1x1x32xf32>
      %66 = stablehlo.multiply %59, %65 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : tensor<4x1x1x32xf32>
      %67 = stablehlo.slice %57 [0:4, 0:1, 0:1, 0:32, 1:2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32x2xf32>) -> tensor<4x1x1x32x1xf32>
      %68 = stablehlo.reshape %67 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32x1xf32>) -> tensor<4x1x1x32xf32>
      %69 = stablehlo.slice %60 [0:1, 0:1, 0:1, 0:32, 1:2] : (tensor<1x1x1x32x2xbf16>) -> tensor<1x1x1x32x1xbf16>
      %70 = stablehlo.reshape %69 : (tensor<1x1x1x32x1xbf16>) -> tensor<1x1x1x32xbf16>
      %71 = stablehlo.convert %70 : (tensor<1x1x1x32xbf16>) -> tensor<1x1x1x32xf32>
      %72 = stablehlo.reshape %71 : (tensor<1x1x1x32xf32>) -> tensor<1x1x32xf32>
      %73 = stablehlo.broadcast_in_dim %72, dims = [1, 2, 3] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<1x1x32xf32>) -> tensor<4x1x1x32xf32>
      %74 = stablehlo.multiply %68, %73 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : tensor<4x1x1x32xf32>
      %75 = stablehlo.subtract %66, %74 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : tensor<4x1x1x32xf32>
      %76 = stablehlo.reshape %75 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32xf32>) -> tensor<4x1x1x32x1xf32>
      %77 = stablehlo.multiply %59, %73 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : tensor<4x1x1x32xf32>
      %78 = stablehlo.multiply %68, %65 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : tensor<4x1x1x32xf32>
      %79 = stablehlo.add %77, %78 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : tensor<4x1x1x32xf32>
      %80 = stablehlo.reshape %79 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32xf32>) -> tensor<4x1x1x32x1xf32>
      %81 = stablehlo.concatenate %76, %80, dim = 4 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32x1xf32>, tensor<4x1x1x32x1xf32>) -> tensor<4x1x1x32x2xf32>
      %82 = stablehlo.reshape %81 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32x2xf32>) -> tensor<4x1x1x64xf32>
      %83 = stablehlo.slice %82 [0:4, 0:1, 0:1, 0:64:2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x64xf32>) -> tensor<4x1x1x32xf32>
      %84 = stablehlo.slice %82 [0:4, 0:1, 0:1, 1:64:2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x64xf32>) -> tensor<4x1x1x32xf32>
      %85 = stablehlo.concatenate %83, %84, dim = 3 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32xf32>, tensor<4x1x1x32xf32>) -> tensor<4x1x1x64xf32>
      %86 = stablehlo.convert %85 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x64xf32>) -> tensor<4x1x1x64xbf16>
      %87 = stablehlo.reshape %86 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x1x64xbf16>) -> tensor<4x1x64xbf16>
      %88 = stablehlo.slice %53 [0:4, 0:1, 64:128] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x128xbf16>) -> tensor<4x1x64xbf16>
      %89 = stablehlo.concatenate %87, %88, dim = 2 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x64xbf16>, tensor<4x1x64xbf16>) -> tensor<4x1x128xbf16>
      %90 = stablehlo.reshape %89 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : (tensor<4x1x128xbf16>) -> tensor<4x128xbf16>
      %91 = stablehlo.reshape %arg27 : (tensor<128x128xbf16>) -> tensor<1x128x128xbf16>
      %92 = stablehlo.reshape %91 : (tensor<1x128x128xbf16>) -> tensor<128x128xbf16>
      %93 = stablehlo.transpose %92, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[128,128]{0,1}"} : (tensor<128x128xbf16>) -> tensor<128x128xbf16>
      %94 = stablehlo.dot_general %90, %93, contracting_dims = [1] x [0] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : (tensor<4x128xbf16>, tensor<128x128xbf16>) -> tensor<4x128xbf16>
      %95 = stablehlo.reshape %94 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x128xbf16>) -> tensor<4x1x128xbf16>
      %96 = stablehlo.floor %cst_4 : tensor<64xf32>
      %97 = stablehlo.convert %96 : (tensor<64xf32>) -> tensor<64xi64>
      %98 = stablehlo.broadcast_in_dim %c_3, dims = [] : (tensor<i64>) -> tensor<64xi64>
      %99 = stablehlo.broadcast_in_dim %c_3, dims = [] : (tensor<i64>) -> tensor<64xi64>
      %100 = stablehlo.clamp %99, %97, %98 : tensor<64xi64>
      %101 = stablehlo.compare  LT, %100, %10 : (tensor<64xi64>, tensor<64xi64>) -> tensor<64xi1>
      %102 = stablehlo.add %100, %9 : tensor<64xi64>
      %103 = stablehlo.select %101, %102, %100 : tensor<64xi1>, tensor<64xi64>
      %104 = stablehlo.reshape %103 : (tensor<64xi64>) -> tensor<64x1xi64>
      %105 = "stablehlo.gather"(%95, %104) <{dimension_numbers = #stablehlo.gather<offset_dims = [0, 2], collapsed_slice_dims = [1], start_index_map = [1], index_vector_dim = 1>, slice_sizes = array<i64: 4, 1, 128>}> {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x128xbf16>, tensor<64x1xi64>) -> tensor<4x64x128xbf16>
      %106 = stablehlo.select %19, %11, %105 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x64x128xi1>, tensor<4x64x128xbf16>
      %107 = stablehlo.select %16, %106, %arg26 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0"}, {}, {}]>]>} : tensor<4x64x128xi1>, tensor<4x64x128xbf16>
      %108 = stablehlo.slice %107 [0:4, 0:33, 0:128] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x64x128xbf16>) -> tensor<4x33x128xbf16>
      %109 = stablehlo.reshape %arg36 : (tensor<3072xbf16>) -> tensor<1x1x3072xbf16>
      %110 = stablehlo.reshape %109 : (tensor<1x1x3072xbf16>) -> tensor<3072xbf16>
      %111 = stablehlo.convert %110 : (tensor<3072xbf16>) -> tensor<3072xf32>
      %112 = stablehlo.broadcast_in_dim %111, dims = [2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<3072xf32>) -> tensor<4x1x3072xf32>
      %113 = stablehlo.reshape %arg35 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {?}, {"_axis_0", ?}]>]>} : (tensor<3072x2048xbf16>) -> tensor<1x3072x2048xbf16>
      %114 = stablehlo.reshape %113 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {"_axis_0", ?}]>]>} : (tensor<1x3072x2048xbf16>) -> tensor<3072x2048xbf16>
      %115 = stablehlo.transpose %114, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>, xla_shape = "bf16[2048,3072]{0,1}"} : (tensor<3072x2048xbf16>) -> tensor<2048x3072xbf16>
      %116 = sdy.all_to_all [{"_axis_0"}: 0->1] %21 out_sharding=<@mesh, [{}, {"_axis_0"}]> : tensor<4x2048xbf16>
      %117 = stablehlo.dot_general %116, %115, contracting_dims = [1] x [0] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {?}]>]>} : (tensor<4x2048xbf16>, tensor<2048x3072xbf16>) -> tensor<4x3072xbf16>
      %118 = sdy.reduce_scatter [{"_axis_0"}, {}] %117 out_sharding=<@mesh, [{"_axis_0"}, {}]> : tensor<4x3072xbf16>
      %119 = stablehlo.reshape %118 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x3072xbf16>) -> tensor<4x1x3072xbf16>
      %120 = stablehlo.convert %119 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x3072xbf16>) -> tensor<4x1x3072xf32>
      %121 = stablehlo.power %120, %8 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x3072xf32>
      %122 = stablehlo.reduce(%121 init: %cst) applies stablehlo.add across dimensions = [2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : (tensor<4x1x3072xf32>, tensor<f32>) -> tensor<4x1xf32>
      %123 = stablehlo.multiply %122, %cst_6 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : tensor<4x1xf32>
      %124 = stablehlo.reshape %123 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1xf32>) -> tensor<4x1x1xf32>
      %125 = stablehlo.add %124, %cst_2 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x1xf32>
      %126 = stablehlo.rsqrt %125 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x1xf32>
      %127 = stablehlo.reshape %126 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : (tensor<4x1x1xf32>) -> tensor<4x1xf32>
      %128 = stablehlo.broadcast_in_dim %127, dims = [0, 1] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1xf32>) -> tensor<4x1x3072xf32>
      %129 = stablehlo.multiply %120, %128 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x3072xf32>
      %130 = stablehlo.multiply %112, %129 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x3072xf32>
      %131 = stablehlo.convert %130 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x3072xf32>) -> tensor<4x1x3072xbf16>
      %132 = stablehlo.reshape %131 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : (tensor<4x1x3072xbf16>) -> tensor<4x3072xbf16>
      %133 = stablehlo.reshape %arg34 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {"_axis_1", ?}, {?}]>]>} : (tensor<8192x3072xbf16>) -> tensor<1x8192x3072xbf16>
      %134 = stablehlo.reshape %133 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_1", ?}, {?}]>]>} : (tensor<1x8192x3072xbf16>) -> tensor<8192x3072xbf16>
      %135 = stablehlo.transpose %134, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {"_axis_1", ?}]>]>, xla_shape = "bf16[3072,8192]{0,1}"} : (tensor<8192x3072xbf16>) -> tensor<3072x8192xbf16>
      %136 = stablehlo.dot_general %132, %135, contracting_dims = [1] x [0] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {"_axis_1", ?}]>]>} : (tensor<4x3072xbf16>, tensor<3072x8192xbf16>) -> tensor<4x8192xbf16>
      %137 = stablehlo.reshape %136 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x8192xbf16>) -> tensor<4x1x64x128xbf16>
      %138 = stablehlo.slice %137 [0:4, 0:1, 0:64, 0:64] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64x128xbf16>) -> tensor<4x1x64x64xbf16>
      %139 = stablehlo.reshape %138 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}, {?}]>]>} : (tensor<4x1x64x64xbf16>) -> tensor<4x1x64x2x32xbf16>
      %140 = stablehlo.transpose %139, dims = [0, 1, 2, 4, 3] {result_layout = dense<[3, 4, 2, 1, 0]> : tensor<5xindex>, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}, {?}]>]>, xla_shape = "bf16[4,1,64,32,2]{3,4,2,1,0}"} : (tensor<4x1x64x2x32xbf16>) -> tensor<4x1x64x32x2xbf16>
      %141 = stablehlo.convert %140 {result_layout = dense<[3, 4, 2, 1, 0]> : tensor<5xindex>, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}, {?}]>]>, xla_shape = "f32[4,1,64,32,2]{3,4,2,1,0}"} : (tensor<4x1x64x32x2xbf16>) -> tensor<4x1x64x32x2xf32>
      %142 = stablehlo.slice %141 [0:4, 0:1, 0:64, 0:32, 0:1] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}, {?}]>]>} : (tensor<4x1x64x32x2xf32>) -> tensor<4x1x64x32x1xf32>
      %143 = stablehlo.reshape %142 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64x32x1xf32>) -> tensor<4x1x64x32xf32>
      %144 = stablehlo.reshape %63 : (tensor<1x1x1x32xf32>) -> tensor<1x32xf32>
      %145 = stablehlo.broadcast_in_dim %144, dims = [1, 3] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<1x32xf32>) -> tensor<4x1x64x32xf32>
      %146 = stablehlo.multiply %143, %145 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : tensor<4x1x64x32xf32>
      %147 = stablehlo.slice %141 [0:4, 0:1, 0:64, 0:32, 1:2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}, {?}]>]>} : (tensor<4x1x64x32x2xf32>) -> tensor<4x1x64x32x1xf32>
      %148 = stablehlo.reshape %147 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64x32x1xf32>) -> tensor<4x1x64x32xf32>
      %149 = stablehlo.reshape %71 : (tensor<1x1x1x32xf32>) -> tensor<1x32xf32>
      %150 = stablehlo.broadcast_in_dim %149, dims = [1, 3] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<1x32xf32>) -> tensor<4x1x64x32xf32>
      %151 = stablehlo.multiply %148, %150 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : tensor<4x1x64x32xf32>
      %152 = stablehlo.subtract %146, %151 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : tensor<4x1x64x32xf32>
      %153 = stablehlo.reshape %152 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}, {?}]>]>} : (tensor<4x1x64x32xf32>) -> tensor<4x1x64x32x1xf32>
      %154 = stablehlo.multiply %143, %150 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : tensor<4x1x64x32xf32>
      %155 = stablehlo.multiply %148, %145 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : tensor<4x1x64x32xf32>
      %156 = stablehlo.add %154, %155 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : tensor<4x1x64x32xf32>
      %157 = stablehlo.reshape %156 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}, {?}]>]>} : (tensor<4x1x64x32xf32>) -> tensor<4x1x64x32x1xf32>
      %158 = stablehlo.concatenate %153, %157, dim = 4 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}, {?}]>]>} : (tensor<4x1x64x32x1xf32>, tensor<4x1x64x32x1xf32>) -> tensor<4x1x64x32x2xf32>
      %159 = stablehlo.reshape %158 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64x32x2xf32>) -> tensor<4x1x64x64xf32>
      %160 = stablehlo.slice %159 [0:4, 0:1, 0:64, 0:64:2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64x64xf32>) -> tensor<4x1x64x32xf32>
      %161 = stablehlo.slice %159 [0:4, 0:1, 0:64, 1:64:2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64x64xf32>) -> tensor<4x1x64x32xf32>
      %162 = stablehlo.concatenate %160, %161, dim = 3 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64x32xf32>, tensor<4x1x64x32xf32>) -> tensor<4x1x64x64xf32>
      %163 = stablehlo.convert %162 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64x64xf32>) -> tensor<4x1x64x64xbf16>
      %164 = stablehlo.slice %137 [0:4, 0:1, 0:64, 64:128] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64x128xbf16>) -> tensor<4x1x64x64xbf16>
      %165 = stablehlo.concatenate %163, %164, dim = 3 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64x64xbf16>, tensor<4x1x64x64xbf16>) -> tensor<4x1x64x128xbf16>
      %166 = stablehlo.dot_general %165, %93, contracting_dims = [3] x [0] {mhlo.frontend_attributes = {grad_x = "false", grad_y = "false"}, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64x128xbf16>, tensor<128x128xbf16>) -> tensor<4x1x64x128xbf16>
      %167 = stablehlo.reshape %166 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64x128xbf16>) -> tensor<4x64x128xbf16>
      %168 = stablehlo.transpose %167, dims = [0, 2, 1] {result_layout = dense<[1, 2, 0]> : tensor<3xindex>, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}]>]>, xla_shape = "bf16[4,128,64]{1,2,0}"} : (tensor<4x64x128xbf16>) -> tensor<4x128x64xbf16>
      %169 = stablehlo.dot_general %108, %168, batching_dims = [0] x [0], contracting_dims = [2] x [1] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}]>]>} : (tensor<4x33x128xbf16>, tensor<4x128x64xbf16>) -> tensor<4x33x64xbf16>
      %170 = stablehlo.maximum %169, %7 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}]>]>} : tensor<4x33x64xbf16>
      %171 = stablehlo.reshape %arg33 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {"_axis_1", ?}, {"_axis_0", ?}]>]>} : (tensor<64x2048xbf16>) -> tensor<1x64x2048xbf16>
      %172 = stablehlo.reshape %171 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_1", ?}, {"_axis_0", ?}]>]>} : (tensor<1x64x2048xbf16>) -> tensor<64x2048xbf16>
      %173 = stablehlo.transpose %172, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {"_axis_1", ?}]>]>, xla_shape = "bf16[2048,64]{0,1}"} : (tensor<64x2048xbf16>) -> tensor<2048x64xbf16>
      %174 = sdy.all_to_all [{"_axis_0"}: 0->1] %21 out_sharding=<@mesh, [{}, {"_axis_0"}]> : tensor<4x2048xbf16>
      %175 = stablehlo.dot_general %174, %173, contracting_dims = [1] x [0] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {"_axis_1", ?}]>]>} : (tensor<4x2048xbf16>, tensor<2048x64xbf16>) -> tensor<4x64xbf16>
      %176 = sdy.reduce_scatter [{"_axis_0"}, {}] %175 out_sharding=<@mesh, [{"_axis_0"}, {"_axis_1"}]> : tensor<4x64xbf16>
      %177 = stablehlo.reshape %176 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}]>]>} : (tensor<4x64xbf16>) -> tensor<4x1x64xbf16>
      %178 = stablehlo.multiply %177, %6 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}]>]>} : tensor<4x1x64xbf16>
      %179 = stablehlo.reshape %178 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : (tensor<4x1x64xbf16>) -> tensor<4x1x64x1xbf16>
      %180 = stablehlo.multiply %179, %5 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}, {?}]>]>} : tensor<4x1x64x1xbf16>
      %181 = stablehlo.reshape %180 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {"_axis_1", ?}]>]>} : (tensor<4x1x64x1xbf16>) -> tensor<4x64xbf16>
      %182 = stablehlo.broadcast_in_dim %181, dims = [0, 2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}]>]>} : (tensor<4x64xbf16>) -> tensor<4x33x64xbf16>
      %183 = stablehlo.multiply %170, %182 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {"_axis_1", ?}]>]>} : tensor<4x33x64xbf16>
      %184 = stablehlo.reduce(%183 init: %cst_11) applies stablehlo.add across dimensions = [2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : (tensor<4x33x64xbf16>, tensor<bf16>) -> tensor<4x33xbf16>
      %185 = sdy.all_reduce {"_axis_1"} %184 out_sharding=<@mesh, [{"_axis_0", ?}, {?}]> : tensor<4x33xbf16>
      %186 = stablehlo.reshape %185 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x33xbf16>) -> tensor<4x1x33xbf16>
      %187 = stablehlo.broadcast_in_dim %14, dims = [1] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<64xi1>) -> tensor<4x64x512xi1>
      %188 = stablehlo.broadcast_in_dim %18, dims = [1] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<64xi1>) -> tensor<4x64x512xi1>
      %189 = stablehlo.reshape %arg22 : (tensor<512xbf16>) -> tensor<1x1x512xbf16>
      %190 = stablehlo.reshape %189 : (tensor<1x1x512xbf16>) -> tensor<512xbf16>
      %191 = stablehlo.convert %190 : (tensor<512xbf16>) -> tensor<512xf32>
      %192 = stablehlo.broadcast_in_dim %191, dims = [2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<512xf32>) -> tensor<4x1x512xf32>
      %193 = stablehlo.reshape %arg20 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {?}, {"_axis_0", ?}]>]>} : (tensor<576x2048xbf16>) -> tensor<1x576x2048xbf16>
      %194 = stablehlo.reshape %193 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {"_axis_0", ?}]>]>} : (tensor<1x576x2048xbf16>) -> tensor<576x2048xbf16>
      %195 = stablehlo.transpose %194, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>, xla_shape = "bf16[2048,576]{0,1}"} : (tensor<576x2048xbf16>) -> tensor<2048x576xbf16>
      %196 = sdy.all_to_all [{"_axis_0"}: 0->1] %21 out_sharding=<@mesh, [{}, {"_axis_0"}]> : tensor<4x2048xbf16>
      %197 = stablehlo.dot_general %196, %195, contracting_dims = [1] x [0] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{?}, {?}]>]>} : (tensor<4x2048xbf16>, tensor<2048x576xbf16>) -> tensor<4x576xbf16>
      %198 = sdy.reduce_scatter [{"_axis_0"}, {}] %197 out_sharding=<@mesh, [{"_axis_0"}, {}]> : tensor<4x576xbf16>
      %199 = stablehlo.reshape %198 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x576xbf16>) -> tensor<4x1x576xbf16>
      %200 = stablehlo.slice %199 [0:4, 0:1, 0:512] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x576xbf16>) -> tensor<4x1x512xbf16>
      %201 = stablehlo.convert %200 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x512xbf16>) -> tensor<4x1x512xf32>
      %202 = stablehlo.power %201, %3 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x512xf32>
      %203 = stablehlo.reduce(%202 init: %cst) applies stablehlo.add across dimensions = [2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : (tensor<4x1x512xf32>, tensor<f32>) -> tensor<4x1xf32>
      %204 = stablehlo.multiply %203, %cst_10 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : tensor<4x1xf32>
      %205 = stablehlo.reshape %204 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1xf32>) -> tensor<4x1x1xf32>
      %206 = stablehlo.add %205, %cst_2 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x1xf32>
      %207 = stablehlo.rsqrt %206 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x1xf32>
      %208 = stablehlo.reshape %207 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}]>]>} : (tensor<4x1x1xf32>) -> tensor<4x1xf32>
      %209 = stablehlo.broadcast_in_dim %208, dims = [0, 1] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1xf32>) -> tensor<4x1x512xf32>
      %210 = stablehlo.multiply %201, %209 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x512xf32>
      %211 = stablehlo.multiply %192, %210 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x1x512xf32>
      %212 = stablehlo.convert %211 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x512xf32>) -> tensor<4x1x512xbf16>
      %213 = "stablehlo.gather"(%212, %104) <{dimension_numbers = #stablehlo.gather<offset_dims = [0, 2], collapsed_slice_dims = [1], start_index_map = [1], index_vector_dim = 1>, slice_sizes = array<i64: 4, 1, 512>}> {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x512xbf16>, tensor<64x1xi64>) -> tensor<4x64x512xbf16>
      %214 = stablehlo.select %188, %4, %213 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : tensor<4x64x512xi1>, tensor<4x64x512xbf16>
      %215 = stablehlo.select %187, %214, %arg19 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0"}, {}, {}]>]>} : tensor<4x64x512xi1>, tensor<4x64x512xbf16>
      %216 = stablehlo.broadcast_in_dim %14, dims = [1] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<64xi1>) -> tensor<4x64x64xi1>
      %217 = stablehlo.broadcast_in_dim %18, dims = [1] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<64xi1>) -> tensor<4x64x64xi1>
      %218 = stablehlo.slice %199 [0:4, 0:1, 512:576] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}]>]>} : (tensor<4x1x576xbf16>) -> tensor<4x1x64xbf16>
      %219 = stablehlo.reshape %218 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<4x1x64xbf16>) -> tensor<4x1x1x64xbf16>
      %220 = stablehlo.convert %219 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x64xbf16>) -> tensor<4x1x1x64xf32>
      %221 = stablehlo.reshape %220 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x64xf32>) -> tensor<4x1x1x32x2xf32>
      %222 = stablehlo.slice %221 [0:4, 0:1, 0:1, 0:32, 0:1] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32x2xf32>) -> tensor<4x1x1x32x1xf32>
      %223 = stablehlo.reshape %222 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32x1xf32>) -> tensor<4x1x1x32xf32>
      %224 = stablehlo.multiply %223, %65 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : tensor<4x1x1x32xf32>
      %225 = stablehlo.slice %221 [0:4, 0:1, 0:1, 0:32, 1:2] {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32x2xf32>) -> tensor<4x1x1x32x1xf32>
      %226 = stablehlo.reshape %225 {sdy.sharding = #sdy.sharding_per_value<[<@mesh, [{"_axis_0", ?}, {?}, {?}, {?}]>]>} : (tensor<4x1x1x32x1xf32>) -> tensor<4x1x1x32xf32>
