#loc = loc(unknown)
module @SyncTensorsGraph.13625 attributes {mhlo.cross_program_prefetches = [], mhlo.input_output_alias = [], mhlo.is_dynamic = false, mhlo.spmd_output_sharding = "{{replicated}}", mhlo.use_auto_spmd_partitioning = false} {
  func.func @main(%arg0: tensor<2560xbf16> loc(unknown), %arg1: tensor<2560x9728xbf16> loc(unknown), %arg2: tensor<9728x2560xbf16> loc(unknown), %arg3: tensor<2560xbf16> loc(unknown), %arg4: tensor<2560x4096xbf16> loc(unknown), %arg5: tensor<1024x2560xbf16> loc(unknown), %arg6: tensor<2560xbf16> loc(unknown), %arg7: tensor<2560x9728xbf16> loc(unknown), %arg8: tensor<9728x2560xbf16> loc(unknown), %arg9: tensor<2560xbf16> loc(unknown), %arg10: tensor<2560x4096xbf16> loc(unknown), %arg11: tensor<1024x2560xbf16> loc(unknown), %arg12: tensor<2560xbf16> loc(unknown), %arg13: tensor<2560x9728xbf16> loc(unknown), %arg14: tensor<9728x2560xbf16> loc(unknown), %arg15: tensor<2560xbf16> loc(unknown), %arg16: tensor<2560x4096xbf16> loc(unknown), %arg17: tensor<1024x2560xbf16> loc(unknown), %arg18: tensor<2560xbf16> loc(unknown), %arg19: tensor<2560x9728xbf16> loc(unknown), %arg20: tensor<9728x2560xbf16> loc(unknown), %arg21: tensor<2560xbf16> loc(unknown), %arg22: tensor<2560x4096xbf16> loc(unknown), %arg23: tensor<1024x2560xbf16> loc(unknown), %arg24: tensor<2560xbf16> loc(unknown), %arg25: tensor<2560x9728xbf16> loc(unknown), %arg26: tensor<9728x2560xbf16> loc(unknown), %arg27: tensor<2560xbf16> loc(unknown), %arg28: tensor<2560x4096xbf16> loc(unknown), %arg29: tensor<1024x2560xbf16> loc(unknown), %arg30: tensor<2560xbf16> loc(unknown), %arg31: tensor<2560x9728xbf16> loc(unknown), %arg32: tensor<9728x2560xbf16> loc(unknown), %arg33: tensor<2560xbf16> loc(unknown), %arg34: tensor<2560x4096xbf16> loc(unknown), %arg35: tensor<1024x2560xbf16> loc(unknown), %arg36: tensor<2560xbf16> loc(unknown), %arg37: tensor<2560x9728xbf16> loc(unknown), %arg38: tensor<9728x2560xbf16> loc(unknown), %arg39: tensor<2560xbf16> loc(unknown), %arg40: tensor<2560x4096xbf16> loc(unknown), %arg41: tensor<1024x2560xbf16> loc(unknown), %arg42: tensor<2560xbf16> loc(unknown), %arg43: tensor<2560x9728xbf16> loc(unknown), %arg44: tensor<9728x2560xbf16> loc(unknown), %arg45: tensor<2560xbf16> loc(unknown), %arg46: tensor<2560x4096xbf16> loc(unknown), %arg47: tensor<1024x2560xbf16> loc(unknown), %arg48: tensor<2560xbf16> loc(unknown), %arg49: tensor<2560x9728xbf16> loc(unknown), %arg50: tensor<9728x2560xbf16> loc(unknown), %arg51: tensor<2560xbf16> loc(unknown), %arg52: tensor<2560x4096xbf16> loc(unknown), %arg53: tensor<1024x2560xbf16> loc(unknown), %arg54: tensor<2560xbf16> loc(unknown), %arg55: tensor<2560x9728xbf16> loc(unknown), %arg56: tensor<9728x2560xbf16> loc(unknown), %arg57: tensor<2560xbf16> loc(unknown), %arg58: tensor<2560x4096xbf16> loc(unknown), %arg59: tensor<1024x2560xbf16> loc(unknown), %arg60: tensor<2560xbf16> loc(unknown), %arg61: tensor<2560x9728xbf16> loc(unknown), %arg62: tensor<9728x2560xbf16> loc(unknown), %arg63: tensor<2560xbf16> loc(unknown), %arg64: tensor<2560x4096xbf16> loc(unknown), %arg65: tensor<1024x2560xbf16> loc(unknown), %arg66: tensor<2560xbf16> loc(unknown), %arg67: tensor<2560x9728xbf16> loc(unknown), %arg68: tensor<9728x2560xbf16> loc(unknown), %arg69: tensor<2560xbf16> loc(unknown), %arg70: tensor<2560x4096xbf16> loc(unknown), %arg71: tensor<1024x2560xbf16> loc(unknown), %arg72: tensor<2560xbf16> loc(unknown), %arg73: tensor<2560x9728xbf16> loc(unknown), %arg74: tensor<9728x2560xbf16> loc(unknown), %arg75: tensor<2560xbf16> loc(unknown), %arg76: tensor<2560x4096xbf16> loc(unknown), %arg77: tensor<1024x2560xbf16> loc(unknown), %arg78: tensor<2560xbf16> loc(unknown), %arg79: tensor<2560x9728xbf16> loc(unknown), %arg80: tensor<9728x2560xbf16> loc(unknown), %arg81: tensor<2560xbf16> loc(unknown), %arg82: tensor<2560x4096xbf16> loc(unknown), %arg83: tensor<1024x2560xbf16> loc(unknown), %arg84: tensor<2560xbf16> loc(unknown), %arg85: tensor<2560x9728xbf16> loc(unknown), %arg86: tensor<9728x2560xbf16> loc(unknown), %arg87: tensor<2560xbf16> loc(unknown), %arg88: tensor<2560x4096xbf16> loc(unknown), %arg89: tensor<1024x2560xbf16> loc(unknown), %arg90: tensor<2560xbf16> loc(unknown), %arg91: tensor<2560x9728xbf16> loc(unknown), %arg92: tensor<9728x2560xbf16> loc(unknown), %arg93: tensor<2560xbf16> loc(unknown), %arg94: tensor<2560x4096xbf16> loc(unknown), %arg95: tensor<1024x2560xbf16> loc(unknown), %arg96: tensor<2560xbf16> loc(unknown), %arg97: tensor<2560x9728xbf16> loc(unknown), %arg98: tensor<9728x2560xbf16> loc(unknown), %arg99: tensor<2560xbf16> loc(unknown), %arg100: tensor<2560x4096xbf16> loc(unknown), %arg101: tensor<1024x2560xbf16> loc(unknown), %arg102: tensor<2560xbf16> loc(unknown), %arg103: tensor<2560x9728xbf16> loc(unknown), %arg104: tensor<9728x2560xbf16> loc(unknown), %arg105: tensor<2560xbf16> loc(unknown), %arg106: tensor<2560x4096xbf16> loc(unknown), %arg107: tensor<1024x2560xbf16> loc(unknown), %arg108: tensor<2560xbf16> loc(unknown), %arg109: tensor<2560x9728xbf16> loc(unknown), %arg110: tensor<9728x2560xbf16> loc(unknown), %arg111: tensor<2560xbf16> loc(unknown), %arg112: tensor<2560x4096xbf16> loc(unknown), %arg113: tensor<1024x2560xbf16> loc(unknown), %arg114: tensor<2560xbf16> loc(unknown), %arg115: tensor<2560x9728xbf16> loc(unknown), %arg116: tensor<9728x2560xbf16> loc(unknown), %arg117: tensor<2560xbf16> loc(unknown), %arg118: tensor<2560x4096xbf16> loc(unknown), %arg119: tensor<1024x2560xbf16> loc(unknown), %arg120: tensor<2560xbf16> loc(unknown), %arg121: tensor<2560x9728xbf16> loc(unknown), %arg122: tensor<9728x2560xbf16> loc(unknown), %arg123: tensor<2560xbf16> loc(unknown), %arg124: tensor<2560x4096xbf16> loc(unknown), %arg125: tensor<1024x2560xbf16> loc(unknown), %arg126: tensor<2560xbf16> loc(unknown), %arg127: tensor<2560x9728xbf16> loc(unknown), %arg128: tensor<9728x2560xbf16> loc(unknown), %arg129: tensor<2560xbf16> loc(unknown), %arg130: tensor<2560x4096xbf16> loc(unknown), %arg131: tensor<1024x2560xbf16> loc(unknown), %arg132: tensor<2560xbf16> loc(unknown), %arg133: tensor<2560x9728xbf16> loc(unknown), %arg134: tensor<9728x2560xbf16> loc(unknown), %arg135: tensor<2560xbf16> loc(unknown), %arg136: tensor<2560x4096xbf16> loc(unknown), %arg137: tensor<1024x2560xbf16> loc(unknown), %arg138: tensor<2560xbf16> loc(unknown), %arg139: tensor<2560x9728xbf16> loc(unknown), %arg140: tensor<9728x2560xbf16> loc(unknown), %arg141: tensor<2560xbf16> loc(unknown), %arg142: tensor<2560x4096xbf16> loc(unknown), %arg143: tensor<1024x2560xbf16> loc(unknown), %arg144: tensor<2560xbf16> loc(unknown), %arg145: tensor<2560x9728xbf16> loc(unknown), %arg146: tensor<9728x2560xbf16> loc(unknown), %arg147: tensor<2560xbf16> loc(unknown), %arg148: tensor<2560x4096xbf16> loc(unknown), %arg149: tensor<1024x2560xbf16> loc(unknown), %arg150: tensor<2560xbf16> loc(unknown), %arg151: tensor<2560x9728xbf16> loc(unknown), %arg152: tensor<9728x2560xbf16> loc(unknown), %arg153: tensor<2560xbf16> loc(unknown), %arg154: tensor<2560x4096xbf16> loc(unknown), %arg155: tensor<1024x2560xbf16> loc(unknown), %arg156: tensor<2560xbf16> loc(unknown), %arg157: tensor<2560x9728xbf16> loc(unknown), %arg158: tensor<9728x2560xbf16> loc(unknown), %arg159: tensor<2560xbf16> loc(unknown), %arg160: tensor<2560x4096xbf16> loc(unknown), %arg161: tensor<1024x2560xbf16> loc(unknown), %arg162: tensor<2560xbf16> loc(unknown), %arg163: tensor<2560x9728xbf16> loc(unknown), %arg164: tensor<9728x2560xbf16> loc(unknown), %arg165: tensor<2560xbf16> loc(unknown), %arg166: tensor<2560x4096xbf16> loc(unknown), %arg167: tensor<1024x2560xbf16> loc(unknown), %arg168: tensor<2560xbf16> loc(unknown), %arg169: tensor<2560x9728xbf16> loc(unknown), %arg170: tensor<9728x2560xbf16> loc(unknown), %arg171: tensor<2560xbf16> loc(unknown), %arg172: tensor<2560x4096xbf16> loc(unknown), %arg173: tensor<1024x2560xbf16> loc(unknown), %arg174: tensor<2560xbf16> loc(unknown), %arg175: tensor<2560x9728xbf16> loc(unknown), %arg176: tensor<9728x2560xbf16> loc(unknown), %arg177: tensor<2560xbf16> loc(unknown), %arg178: tensor<2560x4096xbf16> loc(unknown), %arg179: tensor<1024x2560xbf16> loc(unknown), %arg180: tensor<2560xbf16> loc(unknown), %arg181: tensor<2560x9728xbf16> loc(unknown), %arg182: tensor<9728x2560xbf16> loc(unknown), %arg183: tensor<2560xbf16> loc(unknown), %arg184: tensor<2560x4096xbf16> loc(unknown), %arg185: tensor<1024x2560xbf16> loc(unknown), %arg186: tensor<2560xbf16> loc(unknown), %arg187: tensor<2560x9728xbf16> loc(unknown), %arg188: tensor<9728x2560xbf16> loc(unknown), %arg189: tensor<2560xbf16> loc(unknown), %arg190: tensor<2560x4096xbf16> loc(unknown), %arg191: tensor<1024x2560xbf16> loc(unknown), %arg192: tensor<2560xbf16> loc(unknown), %arg193: tensor<2560x9728xbf16> loc(unknown), %arg194: tensor<9728x2560xbf16> loc(unknown), %arg195: tensor<2560xbf16> loc(unknown), %arg196: tensor<2560x4096xbf16> loc(unknown), %arg197: tensor<1024x2560xbf16> loc(unknown), %arg198: tensor<2560xbf16> loc(unknown), %arg199: tensor<2560x9728xbf16> loc(unknown), %arg200: tensor<9728x2560xbf16> loc(unknown), %arg201: tensor<2560xbf16> loc(unknown), %arg202: tensor<2560x4096xbf16> loc(unknown), %arg203: tensor<1024x2560xbf16> loc(unknown), %arg204: tensor<2560xbf16> loc(unknown), %arg205: tensor<2560x9728xbf16> loc(unknown), %arg206: tensor<9728x2560xbf16> loc(unknown), %arg207: tensor<2560xbf16> loc(unknown), %arg208: tensor<2560x4096xbf16> loc(unknown), %arg209: tensor<1024x2560xbf16> loc(unknown), %arg210: tensor<2560xbf16> loc(unknown), %arg211: tensor<2560x9728xbf16> loc(unknown), %arg212: tensor<9728x2560xbf16> loc(unknown), %arg213: tensor<2560xbf16> loc(unknown), %arg214: tensor<2560x4096xbf16> loc(unknown), %arg215: tensor<1024x2560xbf16> loc(unknown), %arg216: tensor<2560xbf16> loc(unknown), %arg217: tensor<1x7xi64> loc(unknown), %arg218: tensor<151936x2560xbf16> loc(unknown), %arg219: tensor<i1> loc(unknown), %arg220: tensor<64xf32> loc(unknown), %arg221: tensor<128xbf16> loc(unknown), %arg222: tensor<1024x2560xbf16> loc(unknown), %arg223: tensor<128xbf16> loc(unknown), %arg224: tensor<4096x2560xbf16> loc(unknown), %arg225: tensor<9728x2560xbf16> loc(unknown), %arg226: tensor<128xbf16> loc(unknown), %arg227: tensor<1024x2560xbf16> loc(unknown), %arg228: tensor<128xbf16> loc(unknown), %arg229: tensor<4096x2560xbf16> loc(unknown), %arg230: tensor<9728x2560xbf16> loc(unknown), %arg231: tensor<128xbf16> loc(unknown), %arg232: tensor<1024x2560xbf16> loc(unknown), %arg233: tensor<128xbf16> loc(unknown), %arg234: tensor<4096x2560xbf16> loc(unknown), %arg235: tensor<9728x2560xbf16> loc(unknown), %arg236: tensor<128xbf16> loc(unknown), %arg237: tensor<1024x2560xbf16> loc(unknown), %arg238: tensor<128xbf16> loc(unknown), %arg239: tensor<4096x2560xbf16> loc(unknown), %arg240: tensor<9728x2560xbf16> loc(unknown), %arg241: tensor<128xbf16> loc(unknown), %arg242: tensor<1024x2560xbf16> loc(unknown), %arg243: tensor<128xbf16> loc(unknown), %arg244: tensor<4096x2560xbf16> loc(unknown), %arg245: tensor<9728x2560xbf16> loc(unknown), %arg246: tensor<128xbf16> loc(unknown), %arg247: tensor<1024x2560xbf16> loc(unknown), %arg248: tensor<128xbf16> loc(unknown), %arg249: tensor<4096x2560xbf16> loc(unknown), %arg250: tensor<9728x2560xbf16> loc(unknown), %arg251: tensor<128xbf16> loc(unknown), %arg252: tensor<1024x2560xbf16> loc(unknown), %arg253: tensor<128xbf16> loc(unknown), %arg254: tensor<4096x2560xbf16> loc(unknown), %arg255: tensor<9728x2560xbf16> loc(unknown), %arg256: tensor<128xbf16> loc(unknown), %arg257: tensor<1024x2560xbf16> loc(unknown), %arg258: tensor<128xbf16> loc(unknown), %arg259: tensor<4096x2560xbf16> loc(unknown), %arg260: tensor<9728x2560xbf16> loc(unknown), %arg261: tensor<128xbf16> loc(unknown), %arg262: tensor<1024x2560xbf16> loc(unknown), %arg263: tensor<128xbf16> loc(unknown), %arg264: tensor<4096x2560xbf16> loc(unknown), %arg265: tensor<9728x2560xbf16> loc(unknown), %arg266: tensor<128xbf16> loc(unknown), %arg267: tensor<1024x2560xbf16> loc(unknown), %arg268: tensor<128xbf16> loc(unknown), %arg269: tensor<4096x2560xbf16> loc(unknown), %arg270: tensor<9728x2560xbf16> loc(unknown), %arg271: tensor<128xbf16> loc(unknown), %arg272: tensor<1024x2560xbf16> loc(unknown), %arg273: tensor<128xbf16> loc(unknown), %arg274: tensor<4096x2560xbf16> loc(unknown), %arg275: tensor<9728x2560xbf16> loc(unknown), %arg276: tensor<128xbf16> loc(unknown), %arg277: tensor<1024x2560xbf16> loc(unknown), %arg278: tensor<128xbf16> loc(unknown), %arg279: tensor<4096x2560xbf16> loc(unknown), %arg280: tensor<9728x2560xbf16> loc(unknown), %arg281: tensor<128xbf16> loc(unknown), %arg282: tensor<1024x2560xbf16> loc(unknown), %arg283: tensor<128xbf16> loc(unknown), %arg284: tensor<4096x2560xbf16> loc(unknown), %arg285: tensor<9728x2560xbf16> loc(unknown), %arg286: tensor<128xbf16> loc(unknown), %arg287: tensor<1024x2560xbf16> loc(unknown), %arg288: tensor<128xbf16> loc(unknown), %arg289: tensor<4096x2560xbf16> loc(unknown), %arg290: tensor<9728x2560xbf16> loc(unknown), %arg291: tensor<128xbf16> loc(unknown), %arg292: tensor<1024x2560xbf16> loc(unknown), %arg293: tensor<128xbf16> loc(unknown), %arg294: tensor<4096x2560xbf16> loc(unknown), %arg295: tensor<9728x2560xbf16> loc(unknown), %arg296: tensor<128xbf16> loc(unknown), %arg297: tensor<1024x2560xbf16> loc(unknown), %arg298: tensor<128xbf16> loc(unknown), %arg299: tensor<4096x2560xbf16> loc(unknown), %arg300: tensor<9728x2560xbf16> loc(unknown), %arg301: tensor<128xbf16> loc(unknown), %arg302: tensor<1024x2560xbf16> loc(unknown), %arg303: tensor<128xbf16> loc(unknown), %arg304: tensor<4096x2560xbf16> loc(unknown), %arg305: tensor<9728x2560xbf16> loc(unknown), %arg306: tensor<128xbf16> loc(unknown), %arg307: tensor<1024x2560xbf16> loc(unknown), %arg308: tensor<128xbf16> loc(unknown), %arg309: tensor<4096x2560xbf16> loc(unknown), %arg310: tensor<9728x2560xbf16> loc(unknown), %arg311: tensor<128xbf16> loc(unknown), %arg312: tensor<1024x2560xbf16> loc(unknown), %arg313: tensor<128xbf16> loc(unknown), %arg314: tensor<4096x2560xbf16> loc(unknown), %arg315: tensor<9728x2560xbf16> loc(unknown), %arg316: tensor<128xbf16> loc(unknown), %arg317: tensor<1024x2560xbf16> loc(unknown), %arg318: tensor<128xbf16> loc(unknown), %arg319: tensor<4096x2560xbf16> loc(unknown), %arg320: tensor<9728x2560xbf16> loc(unknown), %arg321: tensor<128xbf16> loc(unknown), %arg322: tensor<1024x2560xbf16> loc(unknown), %arg323: tensor<128xbf16> loc(unknown), %arg324: tensor<4096x2560xbf16> loc(unknown), %arg325: tensor<9728x2560xbf16> loc(unknown), %arg326: tensor<128xbf16> loc(unknown), %arg327: tensor<1024x2560xbf16> loc(unknown), %arg328: tensor<128xbf16> loc(unknown), %arg329: tensor<4096x2560xbf16> loc(unknown), %arg330: tensor<9728x2560xbf16> loc(unknown), %arg331: tensor<128xbf16> loc(unknown), %arg332: tensor<1024x2560xbf16> loc(unknown), %arg333: tensor<128xbf16> loc(unknown), %arg334: tensor<4096x2560xbf16> loc(unknown), %arg335: tensor<9728x2560xbf16> loc(unknown), %arg336: tensor<128xbf16> loc(unknown), %arg337: tensor<1024x2560xbf16> loc(unknown), %arg338: tensor<128xbf16> loc(unknown), %arg339: tensor<4096x2560xbf16> loc(unknown), %arg340: tensor<9728x2560xbf16> loc(unknown), %arg341: tensor<128xbf16> loc(unknown), %arg342: tensor<1024x2560xbf16> loc(unknown), %arg343: tensor<128xbf16> loc(unknown), %arg344: tensor<4096x2560xbf16> loc(unknown), %arg345: tensor<9728x2560xbf16> loc(unknown), %arg346: tensor<128xbf16> loc(unknown), %arg347: tensor<1024x2560xbf16> loc(unknown), %arg348: tensor<128xbf16> loc(unknown), %arg349: tensor<4096x2560xbf16> loc(unknown), %arg350: tensor<9728x2560xbf16> loc(unknown), %arg351: tensor<128xbf16> loc(unknown), %arg352: tensor<1024x2560xbf16> loc(unknown), %arg353: tensor<128xbf16> loc(unknown), %arg354: tensor<4096x2560xbf16> loc(unknown), %arg355: tensor<9728x2560xbf16> loc(unknown), %arg356: tensor<128xbf16> loc(unknown), %arg357: tensor<1024x2560xbf16> loc(unknown), %arg358: tensor<128xbf16> loc(unknown), %arg359: tensor<4096x2560xbf16> loc(unknown), %arg360: tensor<9728x2560xbf16> loc(unknown), %arg361: tensor<128xbf16> loc(unknown), %arg362: tensor<1024x2560xbf16> loc(unknown), %arg363: tensor<128xbf16> loc(unknown), %arg364: tensor<4096x2560xbf16> loc(unknown), %arg365: tensor<9728x2560xbf16> loc(unknown), %arg366: tensor<128xbf16> loc(unknown), %arg367: tensor<1024x2560xbf16> loc(unknown), %arg368: tensor<128xbf16> loc(unknown), %arg369: tensor<4096x2560xbf16> loc(unknown), %arg370: tensor<9728x2560xbf16> loc(unknown), %arg371: tensor<128xbf16> loc(unknown), %arg372: tensor<1024x2560xbf16> loc(unknown), %arg373: tensor<128xbf16> loc(unknown), %arg374: tensor<4096x2560xbf16> loc(unknown), %arg375: tensor<9728x2560xbf16> loc(unknown), %arg376: tensor<128xbf16> loc(unknown), %arg377: tensor<1024x2560xbf16> loc(unknown), %arg378: tensor<128xbf16> loc(unknown), %arg379: tensor<4096x2560xbf16> loc(unknown), %arg380: tensor<9728x2560xbf16> loc(unknown), %arg381: tensor<128xbf16> loc(unknown), %arg382: tensor<1024x2560xbf16> loc(unknown), %arg383: tensor<128xbf16> loc(unknown), %arg384: tensor<4096x2560xbf16> loc(unknown), %arg385: tensor<9728x2560xbf16> loc(unknown), %arg386: tensor<128xbf16> loc(unknown), %arg387: tensor<1024x2560xbf16> loc(unknown), %arg388: tensor<128xbf16> loc(unknown), %arg389: tensor<4096x2560xbf16> loc(unknown), %arg390: tensor<9728x2560xbf16> loc(unknown), %arg391: tensor<128xbf16> loc(unknown), %arg392: tensor<1024x2560xbf16> loc(unknown), %arg393: tensor<128xbf16> loc(unknown), %arg394: tensor<4096x2560xbf16> loc(unknown), %arg395: tensor<9728x2560xbf16> loc(unknown), %arg396: tensor<128xbf16> loc(unknown), %arg397: tensor<1024x2560xbf16> loc(unknown), %arg398: tensor<128xbf16> loc(unknown), %arg399: tensor<4096x2560xbf16> loc(unknown), %arg400: tensor<9728x2560xbf16> loc(unknown)) -> tensor<1x7x2560xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x7x2560xbf16> loc(#loc)
    return %cst : tensor<1x7x2560xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_91(%arg0: tensor<1x7x8x128xbf16> loc(unknown), %arg1: tensor<128xbf16> loc(unknown)) -> tensor<1x7x8x128xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %cst_1 = stablehlo.constant dense<7.812500e-03> : tensor<f32> loc(#loc)
    %cst_2 = stablehlo.constant dense<9.99999997E-7> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x8x1xf32> loc(#loc)
    %1 = stablehlo.broadcast_in_dim %cst_1, dims = [] : (tensor<f32>) -> tensor<1x7x8xf32> loc(#loc)
    %2 = stablehlo.broadcast_in_dim %cst_0, dims = [] : (tensor<f32>) -> tensor<1x7x8x128xf32> loc(#loc)
    %3 = stablehlo.convert %arg0 : (tensor<1x7x8x128xbf16>) -> tensor<1x7x8x128xf32> loc(#loc)
    %4 = stablehlo.power %3, %2 : tensor<1x7x8x128xf32> loc(#loc)
    %5 = stablehlo.reduce(%4 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<1x7x8x128xf32>, tensor<f32>) -> tensor<1x7x8xf32> loc(#loc)
    %6 = stablehlo.multiply %5, %1 : tensor<1x7x8xf32> loc(#loc)
    %7 = stablehlo.reshape %6 : (tensor<1x7x8xf32>) -> tensor<1x7x8x1xf32> loc(#loc)
    %8 = stablehlo.add %7, %0 : tensor<1x7x8x1xf32> loc(#loc)
    %9 = stablehlo.rsqrt %8 : tensor<1x7x8x1xf32> loc(#loc)
    %10 = stablehlo.reshape %9 : (tensor<1x7x8x1xf32>) -> tensor<1x7x8xf32> loc(#loc)
    %11 = stablehlo.broadcast_in_dim %10, dims = [0, 1, 2] : (tensor<1x7x8xf32>) -> tensor<1x7x8x128xf32> loc(#loc)
    %12 = stablehlo.multiply %3, %11 : tensor<1x7x8x128xf32> loc(#loc)
    %13 = stablehlo.convert %arg1 : (tensor<128xbf16>) -> tensor<128xf32> loc(#loc)
    %14 = stablehlo.broadcast_in_dim %13, dims = [3] : (tensor<128xf32>) -> tensor<1x7x8x128xf32> loc(#loc)
    %15 = stablehlo.multiply %12, %14 : tensor<1x7x8x128xf32> loc(#loc)
    %16 = stablehlo.convert %15 : (tensor<1x7x8x128xf32>) -> tensor<1x7x8x128xbf16> loc(#loc)
    return %16 : tensor<1x7x8x128xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_81(%arg0: tensor<1x7x2560xbf16> loc(unknown), %arg1: tensor<2560xbf16> loc(unknown)) -> tensor<1x7x2560xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<9.99999997E-7> : tensor<1x7x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.906250e-04> : tensor<1x7xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2560xf32> loc(#loc)
    %1 = stablehlo.convert %arg0 : (tensor<1x7x2560xbf16>) -> tensor<1x7x2560xf32> loc(#loc)
    %2 = stablehlo.power %1, %0 : tensor<1x7x2560xf32> loc(#loc)
    %3 = stablehlo.reduce(%2 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x7x2560xf32>, tensor<f32>) -> tensor<1x7xf32> loc(#loc)
    %4 = stablehlo.multiply %3, %cst_1 : tensor<1x7xf32> loc(#loc)
    %5 = stablehlo.reshape %4 : (tensor<1x7xf32>) -> tensor<1x7x1xf32> loc(#loc)
    %6 = stablehlo.add %5, %cst_0 : tensor<1x7x1xf32> loc(#loc)
    %7 = stablehlo.rsqrt %6 : tensor<1x7x1xf32> loc(#loc)
    %8 = stablehlo.reshape %7 : (tensor<1x7x1xf32>) -> tensor<1x7xf32> loc(#loc)
    %9 = stablehlo.broadcast_in_dim %8, dims = [0, 1] : (tensor<1x7xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %10 = stablehlo.multiply %1, %9 : tensor<1x7x2560xf32> loc(#loc)
    %11 = stablehlo.convert %arg1 : (tensor<2560xbf16>) -> tensor<2560xf32> loc(#loc)
    %12 = stablehlo.broadcast_in_dim %11, dims = [2] : (tensor<2560xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %13 = stablehlo.multiply %10, %12 : tensor<1x7x2560xf32> loc(#loc)
    %14 = stablehlo.convert %13 : (tensor<1x7x2560xf32>) -> tensor<1x7x2560xbf16> loc(#loc)
    return %14 : tensor<1x7x2560xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_134(%arg0: tensor<1x7x2560xbf16> loc(unknown), %arg1: tensor<2560xbf16> loc(unknown)) -> tensor<1x7x2560xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<9.99999997E-7> : tensor<1x7x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.906250e-04> : tensor<1x7xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2560xf32> loc(#loc)
    %1 = stablehlo.convert %arg0 : (tensor<1x7x2560xbf16>) -> tensor<1x7x2560xf32> loc(#loc)
    %2 = stablehlo.power %1, %0 : tensor<1x7x2560xf32> loc(#loc)
    %3 = stablehlo.reduce(%2 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x7x2560xf32>, tensor<f32>) -> tensor<1x7xf32> loc(#loc)
    %4 = stablehlo.multiply %3, %cst_1 : tensor<1x7xf32> loc(#loc)
    %5 = stablehlo.reshape %4 : (tensor<1x7xf32>) -> tensor<1x7x1xf32> loc(#loc)
    %6 = stablehlo.add %5, %cst_0 : tensor<1x7x1xf32> loc(#loc)
    %7 = stablehlo.rsqrt %6 : tensor<1x7x1xf32> loc(#loc)
    %8 = stablehlo.reshape %7 : (tensor<1x7x1xf32>) -> tensor<1x7xf32> loc(#loc)
    %9 = stablehlo.broadcast_in_dim %8, dims = [0, 1] : (tensor<1x7xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %10 = stablehlo.multiply %1, %9 : tensor<1x7x2560xf32> loc(#loc)
    %11 = stablehlo.convert %arg1 : (tensor<2560xbf16>) -> tensor<2560xf32> loc(#loc)
    %12 = stablehlo.broadcast_in_dim %11, dims = [2] : (tensor<2560xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %13 = stablehlo.multiply %10, %12 : tensor<1x7x2560xf32> loc(#loc)
    %14 = stablehlo.convert %13 : (tensor<1x7x2560xf32>) -> tensor<1x7x2560xbf16> loc(#loc)
    return %14 : tensor<1x7x2560xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_7(%arg0: tensor<1x7x2560xbf16> loc(unknown), %arg1: tensor<2560xbf16> loc(unknown)) -> tensor<1x7x2560xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<9.99999997E-7> : tensor<1x7x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.906250e-04> : tensor<1x7xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2560xf32> loc(#loc)
    %1 = stablehlo.convert %arg0 : (tensor<1x7x2560xbf16>) -> tensor<1x7x2560xf32> loc(#loc)
    %2 = stablehlo.power %1, %0 : tensor<1x7x2560xf32> loc(#loc)
    %3 = stablehlo.reduce(%2 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x7x2560xf32>, tensor<f32>) -> tensor<1x7xf32> loc(#loc)
    %4 = stablehlo.multiply %3, %cst_1 : tensor<1x7xf32> loc(#loc)
    %5 = stablehlo.reshape %4 : (tensor<1x7xf32>) -> tensor<1x7x1xf32> loc(#loc)
    %6 = stablehlo.add %5, %cst_0 : tensor<1x7x1xf32> loc(#loc)
    %7 = stablehlo.rsqrt %6 : tensor<1x7x1xf32> loc(#loc)
    %8 = stablehlo.reshape %7 : (tensor<1x7x1xf32>) -> tensor<1x7xf32> loc(#loc)
    %9 = stablehlo.broadcast_in_dim %8, dims = [0, 1] : (tensor<1x7xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %10 = stablehlo.multiply %1, %9 : tensor<1x7x2560xf32> loc(#loc)
    %11 = stablehlo.convert %arg1 : (tensor<2560xbf16>) -> tensor<2560xf32> loc(#loc)
    %12 = stablehlo.broadcast_in_dim %11, dims = [2] : (tensor<2560xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %13 = stablehlo.multiply %10, %12 : tensor<1x7x2560xf32> loc(#loc)
    %14 = stablehlo.convert %13 : (tensor<1x7x2560xf32>) -> tensor<1x7x2560xbf16> loc(#loc)
    return %14 : tensor<1x7x2560xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_20(%arg0: tensor<1x7x8x128xbf16> loc(unknown), %arg1: tensor<128xbf16> loc(unknown)) -> tensor<1x7x8x128xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %cst_1 = stablehlo.constant dense<7.812500e-03> : tensor<f32> loc(#loc)
    %cst_2 = stablehlo.constant dense<9.99999997E-7> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x8x1xf32> loc(#loc)
    %1 = stablehlo.broadcast_in_dim %cst_1, dims = [] : (tensor<f32>) -> tensor<1x7x8xf32> loc(#loc)
    %2 = stablehlo.broadcast_in_dim %cst_0, dims = [] : (tensor<f32>) -> tensor<1x7x8x128xf32> loc(#loc)
    %3 = stablehlo.convert %arg0 : (tensor<1x7x8x128xbf16>) -> tensor<1x7x8x128xf32> loc(#loc)
    %4 = stablehlo.power %3, %2 : tensor<1x7x8x128xf32> loc(#loc)
    %5 = stablehlo.reduce(%4 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<1x7x8x128xf32>, tensor<f32>) -> tensor<1x7x8xf32> loc(#loc)
    %6 = stablehlo.multiply %5, %1 : tensor<1x7x8xf32> loc(#loc)
    %7 = stablehlo.reshape %6 : (tensor<1x7x8xf32>) -> tensor<1x7x8x1xf32> loc(#loc)
    %8 = stablehlo.add %7, %0 : tensor<1x7x8x1xf32> loc(#loc)
    %9 = stablehlo.rsqrt %8 : tensor<1x7x8x1xf32> loc(#loc)
    %10 = stablehlo.reshape %9 : (tensor<1x7x8x1xf32>) -> tensor<1x7x8xf32> loc(#loc)
    %11 = stablehlo.broadcast_in_dim %10, dims = [0, 1, 2] : (tensor<1x7x8xf32>) -> tensor<1x7x8x128xf32> loc(#loc)
    %12 = stablehlo.multiply %3, %11 : tensor<1x7x8x128xf32> loc(#loc)
    %13 = stablehlo.convert %arg1 : (tensor<128xbf16>) -> tensor<128xf32> loc(#loc)
    %14 = stablehlo.broadcast_in_dim %13, dims = [3] : (tensor<128xf32>) -> tensor<1x7x8x128xf32> loc(#loc)
    %15 = stablehlo.multiply %12, %14 : tensor<1x7x8x128xf32> loc(#loc)
    %16 = stablehlo.convert %15 : (tensor<1x7x8x128xf32>) -> tensor<1x7x8x128xbf16> loc(#loc)
    return %16 : tensor<1x7x8x128xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_98(%arg0: tensor<1x7x2560xbf16> loc(unknown), %arg1: tensor<2560xbf16> loc(unknown)) -> tensor<1x7x2560xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<9.99999997E-7> : tensor<1x7x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.906250e-04> : tensor<1x7xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2560xf32> loc(#loc)
    %1 = stablehlo.convert %arg0 : (tensor<1x7x2560xbf16>) -> tensor<1x7x2560xf32> loc(#loc)
    %2 = stablehlo.power %1, %0 : tensor<1x7x2560xf32> loc(#loc)
    %3 = stablehlo.reduce(%2 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x7x2560xf32>, tensor<f32>) -> tensor<1x7xf32> loc(#loc)
    %4 = stablehlo.multiply %3, %cst_1 : tensor<1x7xf32> loc(#loc)
    %5 = stablehlo.reshape %4 : (tensor<1x7xf32>) -> tensor<1x7x1xf32> loc(#loc)
    %6 = stablehlo.add %5, %cst_0 : tensor<1x7x1xf32> loc(#loc)
    %7 = stablehlo.rsqrt %6 : tensor<1x7x1xf32> loc(#loc)
    %8 = stablehlo.reshape %7 : (tensor<1x7x1xf32>) -> tensor<1x7xf32> loc(#loc)
    %9 = stablehlo.broadcast_in_dim %8, dims = [0, 1] : (tensor<1x7xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %10 = stablehlo.multiply %1, %9 : tensor<1x7x2560xf32> loc(#loc)
    %11 = stablehlo.convert %arg1 : (tensor<2560xbf16>) -> tensor<2560xf32> loc(#loc)
    %12 = stablehlo.broadcast_in_dim %11, dims = [2] : (tensor<2560xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %13 = stablehlo.multiply %10, %12 : tensor<1x7x2560xf32> loc(#loc)
    %14 = stablehlo.convert %13 : (tensor<1x7x2560xf32>) -> tensor<1x7x2560xbf16> loc(#loc)
    return %14 : tensor<1x7x2560xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_65(%arg0: tensor<1x7x2560xbf16> loc(unknown), %arg1: tensor<2560xbf16> loc(unknown)) -> tensor<1x7x2560xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<9.99999997E-7> : tensor<1x7x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.906250e-04> : tensor<1x7xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2560xf32> loc(#loc)
    %1 = stablehlo.convert %arg0 : (tensor<1x7x2560xbf16>) -> tensor<1x7x2560xf32> loc(#loc)
    %2 = stablehlo.power %1, %0 : tensor<1x7x2560xf32> loc(#loc)
    %3 = stablehlo.reduce(%2 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x7x2560xf32>, tensor<f32>) -> tensor<1x7xf32> loc(#loc)
    %4 = stablehlo.multiply %3, %cst_1 : tensor<1x7xf32> loc(#loc)
    %5 = stablehlo.reshape %4 : (tensor<1x7xf32>) -> tensor<1x7x1xf32> loc(#loc)
    %6 = stablehlo.add %5, %cst_0 : tensor<1x7x1xf32> loc(#loc)
    %7 = stablehlo.rsqrt %6 : tensor<1x7x1xf32> loc(#loc)
    %8 = stablehlo.reshape %7 : (tensor<1x7x1xf32>) -> tensor<1x7xf32> loc(#loc)
    %9 = stablehlo.broadcast_in_dim %8, dims = [0, 1] : (tensor<1x7xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %10 = stablehlo.multiply %1, %9 : tensor<1x7x2560xf32> loc(#loc)
    %11 = stablehlo.convert %arg1 : (tensor<2560xbf16>) -> tensor<2560xf32> loc(#loc)
    %12 = stablehlo.broadcast_in_dim %11, dims = [2] : (tensor<2560xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %13 = stablehlo.multiply %10, %12 : tensor<1x7x2560xf32> loc(#loc)
    %14 = stablehlo.convert %13 : (tensor<1x7x2560xf32>) -> tensor<1x7x2560xbf16> loc(#loc)
    return %14 : tensor<1x7x2560xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_80(%arg0: tensor<1x7x2560xbf16> loc(unknown), %arg1: tensor<2560xbf16> loc(unknown)) -> tensor<1x7x2560xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<9.99999997E-7> : tensor<1x7x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.906250e-04> : tensor<1x7xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2560xf32> loc(#loc)
    %1 = stablehlo.convert %arg0 : (tensor<1x7x2560xbf16>) -> tensor<1x7x2560xf32> loc(#loc)
    %2 = stablehlo.power %1, %0 : tensor<1x7x2560xf32> loc(#loc)
    %3 = stablehlo.reduce(%2 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x7x2560xf32>, tensor<f32>) -> tensor<1x7xf32> loc(#loc)
    %4 = stablehlo.multiply %3, %cst_1 : tensor<1x7xf32> loc(#loc)
    %5 = stablehlo.reshape %4 : (tensor<1x7xf32>) -> tensor<1x7x1xf32> loc(#loc)
    %6 = stablehlo.add %5, %cst_0 : tensor<1x7x1xf32> loc(#loc)
    %7 = stablehlo.rsqrt %6 : tensor<1x7x1xf32> loc(#loc)
    %8 = stablehlo.reshape %7 : (tensor<1x7x1xf32>) -> tensor<1x7xf32> loc(#loc)
    %9 = stablehlo.broadcast_in_dim %8, dims = [0, 1] : (tensor<1x7xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %10 = stablehlo.multiply %1, %9 : tensor<1x7x2560xf32> loc(#loc)
    %11 = stablehlo.convert %arg1 : (tensor<2560xbf16>) -> tensor<2560xf32> loc(#loc)
    %12 = stablehlo.broadcast_in_dim %11, dims = [2] : (tensor<2560xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %13 = stablehlo.multiply %10, %12 : tensor<1x7x2560xf32> loc(#loc)
    %14 = stablehlo.convert %13 : (tensor<1x7x2560xf32>) -> tensor<1x7x2560xbf16> loc(#loc)
    return %14 : tensor<1x7x2560xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_0(%arg0: tensor<1x7x2560xbf16> loc(unknown), %arg1: tensor<2560xbf16> loc(unknown)) -> tensor<1x7x2560xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<9.99999997E-7> : tensor<1x7x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.906250e-04> : tensor<1x7xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2560xf32> loc(#loc)
    %1 = stablehlo.convert %arg0 : (tensor<1x7x2560xbf16>) -> tensor<1x7x2560xf32> loc(#loc)
    %2 = stablehlo.power %1, %0 : tensor<1x7x2560xf32> loc(#loc)
    %3 = stablehlo.reduce(%2 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x7x2560xf32>, tensor<f32>) -> tensor<1x7xf32> loc(#loc)
    %4 = stablehlo.multiply %3, %cst_1 : tensor<1x7xf32> loc(#loc)
    %5 = stablehlo.reshape %4 : (tensor<1x7xf32>) -> tensor<1x7x1xf32> loc(#loc)
    %6 = stablehlo.add %5, %cst_0 : tensor<1x7x1xf32> loc(#loc)
    %7 = stablehlo.rsqrt %6 : tensor<1x7x1xf32> loc(#loc)
    %8 = stablehlo.reshape %7 : (tensor<1x7x1xf32>) -> tensor<1x7xf32> loc(#loc)
    %9 = stablehlo.broadcast_in_dim %8, dims = [0, 1] : (tensor<1x7xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %10 = stablehlo.multiply %1, %9 : tensor<1x7x2560xf32> loc(#loc)
    %11 = stablehlo.convert %arg1 : (tensor<2560xbf16>) -> tensor<2560xf32> loc(#loc)
    %12 = stablehlo.broadcast_in_dim %11, dims = [2] : (tensor<2560xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %13 = stablehlo.multiply %10, %12 : tensor<1x7x2560xf32> loc(#loc)
    %14 = stablehlo.convert %13 : (tensor<1x7x2560xf32>) -> tensor<1x7x2560xbf16> loc(#loc)
    return %14 : tensor<1x7x2560xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_32(%arg0: tensor<1x7x2x128xbf16> loc(unknown), %arg1: tensor<128xbf16> loc(unknown)) -> tensor<1x7x2x128xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %cst_1 = stablehlo.constant dense<7.812500e-03> : tensor<f32> loc(#loc)
    %cst_2 = stablehlo.constant dense<9.99999997E-7> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2x1xf32> loc(#loc)
    %1 = stablehlo.broadcast_in_dim %cst_1, dims = [] : (tensor<f32>) -> tensor<1x7x2xf32> loc(#loc)
    %2 = stablehlo.broadcast_in_dim %cst_0, dims = [] : (tensor<f32>) -> tensor<1x7x2x128xf32> loc(#loc)
    %3 = stablehlo.convert %arg0 : (tensor<1x7x2x128xbf16>) -> tensor<1x7x2x128xf32> loc(#loc)
    %4 = stablehlo.power %3, %2 : tensor<1x7x2x128xf32> loc(#loc)
    %5 = stablehlo.reduce(%4 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<1x7x2x128xf32>, tensor<f32>) -> tensor<1x7x2xf32> loc(#loc)
    %6 = stablehlo.multiply %5, %1 : tensor<1x7x2xf32> loc(#loc)
    %7 = stablehlo.reshape %6 : (tensor<1x7x2xf32>) -> tensor<1x7x2x1xf32> loc(#loc)
    %8 = stablehlo.add %7, %0 : tensor<1x7x2x1xf32> loc(#loc)
    %9 = stablehlo.rsqrt %8 : tensor<1x7x2x1xf32> loc(#loc)
    %10 = stablehlo.reshape %9 : (tensor<1x7x2x1xf32>) -> tensor<1x7x2xf32> loc(#loc)
    %11 = stablehlo.broadcast_in_dim %10, dims = [0, 1, 2] : (tensor<1x7x2xf32>) -> tensor<1x7x2x128xf32> loc(#loc)
    %12 = stablehlo.multiply %3, %11 : tensor<1x7x2x128xf32> loc(#loc)
    %13 = stablehlo.convert %arg1 : (tensor<128xbf16>) -> tensor<128xf32> loc(#loc)
    %14 = stablehlo.broadcast_in_dim %13, dims = [3] : (tensor<128xf32>) -> tensor<1x7x2x128xf32> loc(#loc)
    %15 = stablehlo.multiply %12, %14 : tensor<1x7x2x128xf32> loc(#loc)
    %16 = stablehlo.convert %15 : (tensor<1x7x2x128xf32>) -> tensor<1x7x2x128xbf16> loc(#loc)
    return %16 : tensor<1x7x2x128xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_142(%arg0: tensor<1x7x8x128xbf16> loc(unknown), %arg1: tensor<128xbf16> loc(unknown)) -> tensor<1x7x8x128xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %cst_1 = stablehlo.constant dense<7.812500e-03> : tensor<f32> loc(#loc)
    %cst_2 = stablehlo.constant dense<9.99999997E-7> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x8x1xf32> loc(#loc)
    %1 = stablehlo.broadcast_in_dim %cst_1, dims = [] : (tensor<f32>) -> tensor<1x7x8xf32> loc(#loc)
    %2 = stablehlo.broadcast_in_dim %cst_0, dims = [] : (tensor<f32>) -> tensor<1x7x8x128xf32> loc(#loc)
    %3 = stablehlo.convert %arg0 : (tensor<1x7x8x128xbf16>) -> tensor<1x7x8x128xf32> loc(#loc)
    %4 = stablehlo.power %3, %2 : tensor<1x7x8x128xf32> loc(#loc)
    %5 = stablehlo.reduce(%4 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<1x7x8x128xf32>, tensor<f32>) -> tensor<1x7x8xf32> loc(#loc)
    %6 = stablehlo.multiply %5, %1 : tensor<1x7x8xf32> loc(#loc)
    %7 = stablehlo.reshape %6 : (tensor<1x7x8xf32>) -> tensor<1x7x8x1xf32> loc(#loc)
    %8 = stablehlo.add %7, %0 : tensor<1x7x8x1xf32> loc(#loc)
    %9 = stablehlo.rsqrt %8 : tensor<1x7x8x1xf32> loc(#loc)
    %10 = stablehlo.reshape %9 : (tensor<1x7x8x1xf32>) -> tensor<1x7x8xf32> loc(#loc)
    %11 = stablehlo.broadcast_in_dim %10, dims = [0, 1, 2] : (tensor<1x7x8xf32>) -> tensor<1x7x8x128xf32> loc(#loc)
    %12 = stablehlo.multiply %3, %11 : tensor<1x7x8x128xf32> loc(#loc)
    %13 = stablehlo.convert %arg1 : (tensor<128xbf16>) -> tensor<128xf32> loc(#loc)
    %14 = stablehlo.broadcast_in_dim %13, dims = [3] : (tensor<128xf32>) -> tensor<1x7x8x128xf32> loc(#loc)
    %15 = stablehlo.multiply %12, %14 : tensor<1x7x8x128xf32> loc(#loc)
    %16 = stablehlo.convert %15 : (tensor<1x7x8x128xf32>) -> tensor<1x7x8x128xbf16> loc(#loc)
    return %16 : tensor<1x7x8x128xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_95(%arg0: tensor<1x7x2560xbf16> loc(unknown), %arg1: tensor<2560xbf16> loc(unknown)) -> tensor<1x7x2560xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<9.99999997E-7> : tensor<1x7x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.906250e-04> : tensor<1x7xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2560xf32> loc(#loc)
    %1 = stablehlo.convert %arg0 : (tensor<1x7x2560xbf16>) -> tensor<1x7x2560xf32> loc(#loc)
    %2 = stablehlo.power %1, %0 : tensor<1x7x2560xf32> loc(#loc)
    %3 = stablehlo.reduce(%2 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x7x2560xf32>, tensor<f32>) -> tensor<1x7xf32> loc(#loc)
    %4 = stablehlo.multiply %3, %cst_1 : tensor<1x7xf32> loc(#loc)
    %5 = stablehlo.reshape %4 : (tensor<1x7xf32>) -> tensor<1x7x1xf32> loc(#loc)
    %6 = stablehlo.add %5, %cst_0 : tensor<1x7x1xf32> loc(#loc)
    %7 = stablehlo.rsqrt %6 : tensor<1x7x1xf32> loc(#loc)
    %8 = stablehlo.reshape %7 : (tensor<1x7x1xf32>) -> tensor<1x7xf32> loc(#loc)
    %9 = stablehlo.broadcast_in_dim %8, dims = [0, 1] : (tensor<1x7xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %10 = stablehlo.multiply %1, %9 : tensor<1x7x2560xf32> loc(#loc)
    %11 = stablehlo.convert %arg1 : (tensor<2560xbf16>) -> tensor<2560xf32> loc(#loc)
    %12 = stablehlo.broadcast_in_dim %11, dims = [2] : (tensor<2560xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %13 = stablehlo.multiply %10, %12 : tensor<1x7x2560xf32> loc(#loc)
    %14 = stablehlo.convert %13 : (tensor<1x7x2560xf32>) -> tensor<1x7x2560xbf16> loc(#loc)
    return %14 : tensor<1x7x2560xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_67(%arg0: tensor<1x7x2x128xbf16> loc(unknown), %arg1: tensor<128xbf16> loc(unknown)) -> tensor<1x7x2x128xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %cst_1 = stablehlo.constant dense<7.812500e-03> : tensor<f32> loc(#loc)
    %cst_2 = stablehlo.constant dense<9.99999997E-7> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2x1xf32> loc(#loc)
    %1 = stablehlo.broadcast_in_dim %cst_1, dims = [] : (tensor<f32>) -> tensor<1x7x2xf32> loc(#loc)
    %2 = stablehlo.broadcast_in_dim %cst_0, dims = [] : (tensor<f32>) -> tensor<1x7x2x128xf32> loc(#loc)
    %3 = stablehlo.convert %arg0 : (tensor<1x7x2x128xbf16>) -> tensor<1x7x2x128xf32> loc(#loc)
    %4 = stablehlo.power %3, %2 : tensor<1x7x2x128xf32> loc(#loc)
    %5 = stablehlo.reduce(%4 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<1x7x2x128xf32>, tensor<f32>) -> tensor<1x7x2xf32> loc(#loc)
    %6 = stablehlo.multiply %5, %1 : tensor<1x7x2xf32> loc(#loc)
    %7 = stablehlo.reshape %6 : (tensor<1x7x2xf32>) -> tensor<1x7x2x1xf32> loc(#loc)
    %8 = stablehlo.add %7, %0 : tensor<1x7x2x1xf32> loc(#loc)
    %9 = stablehlo.rsqrt %8 : tensor<1x7x2x1xf32> loc(#loc)
    %10 = stablehlo.reshape %9 : (tensor<1x7x2x1xf32>) -> tensor<1x7x2xf32> loc(#loc)
    %11 = stablehlo.broadcast_in_dim %10, dims = [0, 1, 2] : (tensor<1x7x2xf32>) -> tensor<1x7x2x128xf32> loc(#loc)
    %12 = stablehlo.multiply %3, %11 : tensor<1x7x2x128xf32> loc(#loc)
    %13 = stablehlo.convert %arg1 : (tensor<128xbf16>) -> tensor<128xf32> loc(#loc)
    %14 = stablehlo.broadcast_in_dim %13, dims = [3] : (tensor<128xf32>) -> tensor<1x7x2x128xf32> loc(#loc)
    %15 = stablehlo.multiply %12, %14 : tensor<1x7x2x128xf32> loc(#loc)
    %16 = stablehlo.convert %15 : (tensor<1x7x2x128xf32>) -> tensor<1x7x2x128xbf16> loc(#loc)
    return %16 : tensor<1x7x2x128xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_53(%arg0: tensor<1x7x8x128xbf16> loc(unknown), %arg1: tensor<128xbf16> loc(unknown)) -> tensor<1x7x8x128xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %cst_1 = stablehlo.constant dense<7.812500e-03> : tensor<f32> loc(#loc)
    %cst_2 = stablehlo.constant dense<9.99999997E-7> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x8x1xf32> loc(#loc)
    %1 = stablehlo.broadcast_in_dim %cst_1, dims = [] : (tensor<f32>) -> tensor<1x7x8xf32> loc(#loc)
    %2 = stablehlo.broadcast_in_dim %cst_0, dims = [] : (tensor<f32>) -> tensor<1x7x8x128xf32> loc(#loc)
    %3 = stablehlo.convert %arg0 : (tensor<1x7x8x128xbf16>) -> tensor<1x7x8x128xf32> loc(#loc)
    %4 = stablehlo.power %3, %2 : tensor<1x7x8x128xf32> loc(#loc)
    %5 = stablehlo.reduce(%4 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<1x7x8x128xf32>, tensor<f32>) -> tensor<1x7x8xf32> loc(#loc)
    %6 = stablehlo.multiply %5, %1 : tensor<1x7x8xf32> loc(#loc)
    %7 = stablehlo.reshape %6 : (tensor<1x7x8xf32>) -> tensor<1x7x8x1xf32> loc(#loc)
    %8 = stablehlo.add %7, %0 : tensor<1x7x8x1xf32> loc(#loc)
    %9 = stablehlo.rsqrt %8 : tensor<1x7x8x1xf32> loc(#loc)
    %10 = stablehlo.reshape %9 : (tensor<1x7x8x1xf32>) -> tensor<1x7x8xf32> loc(#loc)
    %11 = stablehlo.broadcast_in_dim %10, dims = [0, 1, 2] : (tensor<1x7x8xf32>) -> tensor<1x7x8x128xf32> loc(#loc)
    %12 = stablehlo.multiply %3, %11 : tensor<1x7x8x128xf32> loc(#loc)
    %13 = stablehlo.convert %arg1 : (tensor<128xbf16>) -> tensor<128xf32> loc(#loc)
    %14 = stablehlo.broadcast_in_dim %13, dims = [3] : (tensor<128xf32>) -> tensor<1x7x8x128xf32> loc(#loc)
    %15 = stablehlo.multiply %12, %14 : tensor<1x7x8x128xf32> loc(#loc)
    %16 = stablehlo.convert %15 : (tensor<1x7x8x128xf32>) -> tensor<1x7x8x128xbf16> loc(#loc)
    return %16 : tensor<1x7x8x128xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_39(%arg0: tensor<1x7x2560xbf16> loc(unknown), %arg1: tensor<2560xbf16> loc(unknown)) -> tensor<1x7x2560xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<9.99999997E-7> : tensor<1x7x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.906250e-04> : tensor<1x7xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2560xf32> loc(#loc)
    %1 = stablehlo.convert %arg0 : (tensor<1x7x2560xbf16>) -> tensor<1x7x2560xf32> loc(#loc)
    %2 = stablehlo.power %1, %0 : tensor<1x7x2560xf32> loc(#loc)
    %3 = stablehlo.reduce(%2 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x7x2560xf32>, tensor<f32>) -> tensor<1x7xf32> loc(#loc)
    %4 = stablehlo.multiply %3, %cst_1 : tensor<1x7xf32> loc(#loc)
    %5 = stablehlo.reshape %4 : (tensor<1x7xf32>) -> tensor<1x7x1xf32> loc(#loc)
    %6 = stablehlo.add %5, %cst_0 : tensor<1x7x1xf32> loc(#loc)
    %7 = stablehlo.rsqrt %6 : tensor<1x7x1xf32> loc(#loc)
    %8 = stablehlo.reshape %7 : (tensor<1x7x1xf32>) -> tensor<1x7xf32> loc(#loc)
    %9 = stablehlo.broadcast_in_dim %8, dims = [0, 1] : (tensor<1x7xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %10 = stablehlo.multiply %1, %9 : tensor<1x7x2560xf32> loc(#loc)
    %11 = stablehlo.convert %arg1 : (tensor<2560xbf16>) -> tensor<2560xf32> loc(#loc)
    %12 = stablehlo.broadcast_in_dim %11, dims = [2] : (tensor<2560xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %13 = stablehlo.multiply %10, %12 : tensor<1x7x2560xf32> loc(#loc)
    %14 = stablehlo.convert %13 : (tensor<1x7x2560xf32>) -> tensor<1x7x2560xbf16> loc(#loc)
    return %14 : tensor<1x7x2560xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_17(%arg0: tensor<1x7x2560xbf16> loc(unknown), %arg1: tensor<2560xbf16> loc(unknown)) -> tensor<1x7x2560xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<9.99999997E-7> : tensor<1x7x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.906250e-04> : tensor<1x7xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2560xf32> loc(#loc)
    %1 = stablehlo.convert %arg0 : (tensor<1x7x2560xbf16>) -> tensor<1x7x2560xf32> loc(#loc)
    %2 = stablehlo.power %1, %0 : tensor<1x7x2560xf32> loc(#loc)
    %3 = stablehlo.reduce(%2 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x7x2560xf32>, tensor<f32>) -> tensor<1x7xf32> loc(#loc)
    %4 = stablehlo.multiply %3, %cst_1 : tensor<1x7xf32> loc(#loc)
    %5 = stablehlo.reshape %4 : (tensor<1x7xf32>) -> tensor<1x7x1xf32> loc(#loc)
    %6 = stablehlo.add %5, %cst_0 : tensor<1x7x1xf32> loc(#loc)
    %7 = stablehlo.rsqrt %6 : tensor<1x7x1xf32> loc(#loc)
    %8 = stablehlo.reshape %7 : (tensor<1x7x1xf32>) -> tensor<1x7xf32> loc(#loc)
    %9 = stablehlo.broadcast_in_dim %8, dims = [0, 1] : (tensor<1x7xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %10 = stablehlo.multiply %1, %9 : tensor<1x7x2560xf32> loc(#loc)
    %11 = stablehlo.convert %arg1 : (tensor<2560xbf16>) -> tensor<2560xf32> loc(#loc)
    %12 = stablehlo.broadcast_in_dim %11, dims = [2] : (tensor<2560xf32>) -> tensor<1x7x2560xf32> loc(#loc)
    %13 = stablehlo.multiply %10, %12 : tensor<1x7x2560xf32> loc(#loc)
    %14 = stablehlo.convert %13 : (tensor<1x7x2560xf32>) -> tensor<1x7x2560xbf16> loc(#loc)
    return %14 : tensor<1x7x2560xbf16> loc(#loc)
  } loc(#loc)
  func.func private @outlined_composite_tenstorrent.rms_norm.impl_108(%arg0: tensor<1x7x2560xbf16> loc(unknown), %arg1: tensor<2560xbf16> loc(unknown)) -> tensor<1x7x2560xbf16> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<9.99999997E-7> : tensor<1x7x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.906250e-04> : tensor<1x7xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<1x7x2560xf32> loc(#loc)
    %1 = stablehlo.convert %arg0 : (tensor<1x7x2560xbf16>) -> tensor<1x7x2560xf32> loc(#loc)
    %2 = stablehlo.power %1, %0 : tensor<1x7x2560xf32> loc(#loc)
    %3 = stablehlo.reduce(%2 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x7x2560xf32>, tensor<f32>) -> tensor<1x7xf32> loc(#loc)
    %4 = stablehlo.multiply %3, %cst_1 : tensor<1x7xf32> loc(#loc)
