#loc1 = loc("unknown|unknown|-1|unknownxla__device_data")
module @SyncTensorsGraph.4178 attributes {mhlo.cross_program_prefetches = [], mhlo.input_output_alias = [], mhlo.is_dynamic = false, mhlo.use_auto_spmd_partitioning = false} {
  func.func @main(%arg0: tensor<512x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg1: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg2: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg3: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg4: tensor<768x3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg5: tensor<3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg6: tensor<3072x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg7: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg8: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg9: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg10: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg11: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg12: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg13: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg14: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg15: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg16: tensor<768x3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg17: tensor<3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg18: tensor<3072x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg19: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg20: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg21: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg22: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg23: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg24: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg25: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg26: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg27: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg28: tensor<768x3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg29: tensor<3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg30: tensor<3072x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg31: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg32: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg33: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg34: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg35: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg36: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg37: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg38: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg39: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg40: tensor<768x3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg41: tensor<3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg42: tensor<3072x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg43: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg44: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg45: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg46: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg47: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg48: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg49: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg50: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg51: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg52: tensor<768x3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg53: tensor<3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg54: tensor<3072x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg55: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg56: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg57: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg58: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg59: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg60: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg61: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg62: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg63: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg64: tensor<768x3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg65: tensor<3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg66: tensor<3072x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg67: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg68: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg69: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg70: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg71: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg72: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg73: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg74: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg75: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg76: tensor<768x3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg77: tensor<3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg78: tensor<3072x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg79: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg80: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg81: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg82: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg83: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg84: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg85: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg86: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg87: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg88: tensor<768x3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg89: tensor<3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg90: tensor<3072x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg91: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg92: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg93: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg94: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg95: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg96: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg97: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg98: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg99: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg100: tensor<768x3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg101: tensor<3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg102: tensor<3072x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg103: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg104: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg105: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg106: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg107: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg108: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg109: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg110: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg111: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg112: tensor<768x3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg113: tensor<3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg114: tensor<3072x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg115: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg116: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg117: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg118: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg119: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg120: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg121: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg122: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg123: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg124: tensor<768x3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg125: tensor<3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg126: tensor<3072x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg127: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg128: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg129: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg130: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg131: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg132: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg133: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg134: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg135: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg136: tensor<768x3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg137: tensor<3072xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg138: tensor<3072x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg139: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg140: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg141: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg142: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg143: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg144: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg145: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg146: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg147: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg148: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg149: tensor<1x50xi64> loc("unknown|unknown|-1|unknownxla__device_data"), %arg150: tensor<50x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg151: tensor<768x3x32x32xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg152: tensor<2x3x224x224xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg153: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg154: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg155: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg156: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg157: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg158: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg159: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg160: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg161: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg162: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg163: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg164: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg165: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg166: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg167: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg168: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg169: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg170: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg171: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg172: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg173: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg174: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg175: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg176: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg177: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg178: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg179: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg180: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg181: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg182: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg183: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg184: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg185: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg186: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg187: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg188: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg189: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg190: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg191: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg192: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg193: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg194: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg195: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg196: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg197: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg198: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg199: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg200: tensor<768xbf16> loc("unknown|unknown|-1|unknownxla__device_data"), %arg201: tensor<768x768xbf16> loc("unknown|unknown|-1|unknownxla__device_data")) -> (tensor<2x512xbf16>, tensor<2x50x768xbf16>) {
    %cst = stablehlo.constant dense<1.001360e-05> : tensor<2x1xbf16> loc(#loc)
    %cst_0 = stablehlo.constant dense<1.304630e-03> : tensor<2xbf16> loc(#loc)
    %cst_1 = stablehlo.constant dense<1.703130e+00> : tensor<2x50x3072xbf16> loc(#loc)
    %cst_2 = stablehlo.constant dense<1.250000e-01> : tensor<2x12x50x50xbf16> loc(#loc)
    %cst_3 = stablehlo.constant dense<1.001360e-05> : tensor<2x50x1xbf16> loc(#loc)
    %cst_4 = stablehlo.constant dense<1.304630e-03> : tensor<2x50xbf16> loc(#loc)
    %cst_5 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_6 = stablehlo.constant dense<0xFF800000> : tensor<f32> loc(#loc)
    %cst_7 = stablehlo.constant dense<0.000000e+00> : tensor<bf16> loc(#loc)
    %0 = stablehlo.reshape %arg153 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %1 = stablehlo.custom_call @tt.mark_argument(%0) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_embeddings_class_embedding"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %2 = stablehlo.reshape %1 : (tensor<1x1x768xbf16>) -> tensor<1x768xbf16> loc(#loc4)
    %3 = stablehlo.broadcast_in_dim %2, dims = [1, 2] : (tensor<1x768xbf16>) -> tensor<2x1x768xbf16> loc(#loc4)
    %4 = stablehlo.custom_call @tt.mark_argument(%arg152) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "input", ttir.name = "args_0"}} : (tensor<2x3x224x224xbf16>) -> tensor<2x3x224x224xbf16> loc(#loc3)
    %5 = stablehlo.custom_call @tt.mark_argument(%arg151) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_embeddings_patch_embedding_weight"}} : (tensor<768x3x32x32xbf16>) -> tensor<768x3x32x32xbf16> loc(#loc3)
    %6 = stablehlo.convolution(%4, %5) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {stride = [32, 32]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<2x3x224x224xbf16>, tensor<768x3x32x32xbf16>) -> tensor<2x768x7x7xbf16> loc(#loc5)
    %7 = stablehlo.reshape %6 : (tensor<2x768x7x7xbf16>) -> tensor<2x768x49xbf16> loc(#loc6)
    %8 = stablehlo.transpose %7, dims = [0, 2, 1] {result_layout = dense<[1, 2, 0]> : tensor<3xindex>, xla_shape = "bf16[2,49,768]{1,2,0}"} : (tensor<2x768x49xbf16>) -> tensor<2x49x768xbf16> loc(#loc7)
    %9 = stablehlo.concatenate %3, %8, dim = 1 : (tensor<2x1x768xbf16>, tensor<2x49x768xbf16>) -> tensor<2x50x768xbf16> loc(#loc8)
    %10 = stablehlo.reshape %arg150 : (tensor<50x768xbf16>) -> tensor<1x50x768xbf16> loc(#loc2)
    %11 = stablehlo.custom_call @tt.mark_argument(%10) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_embeddings_position_embedding_weight"}} : (tensor<1x50x768xbf16>) -> tensor<1x50x768xbf16> loc(#loc3)
    %12 = stablehlo.reshape %11 : (tensor<1x50x768xbf16>) -> tensor<50x768xbf16> loc(#loc2)
    %13 = stablehlo.reshape %arg149 : (tensor<1x50xi64>) -> tensor<1x1x50xi64> loc(#loc2)
    %14 = stablehlo.custom_call @tt.mark_argument(%13) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___vision_model_embeddings_position_ids"}} : (tensor<1x1x50xi64>) -> tensor<1x1x50xi64> loc(#loc3)
    %15 = stablehlo.reshape %14 : (tensor<1x1x50xi64>) -> tensor<50xi64> loc(#loc9)
    %16 = stablehlo.convert %15 : (tensor<50xi64>) -> tensor<50xui32> loc(#loc10)
    %17 = "stablehlo.gather"(%12, %16) <{dimension_numbers = #stablehlo.gather<offset_dims = [1], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, slice_sizes = array<i64: 1, 768>}> : (tensor<50x768xbf16>, tensor<50xui32>) -> tensor<50x768xbf16> loc(#loc10)
    %18 = stablehlo.broadcast_in_dim %17, dims = [1, 2] : (tensor<50x768xbf16>) -> tensor<2x50x768xbf16> loc(#loc11)
    %19 = stablehlo.add %9, %18 : tensor<2x50x768xbf16> loc(#loc11)
    %20 = stablehlo.reduce(%19 init: %cst_7) applies stablehlo.add across dimensions = [2] : (tensor<2x50x768xbf16>, tensor<bf16>) -> tensor<2x50xbf16> loc(#loc12)
    %21 = stablehlo.multiply %20, %cst_4 : tensor<2x50xbf16> loc(#loc12)
    %22 = stablehlo.broadcast_in_dim %21, dims = [0, 1] : (tensor<2x50xbf16>) -> tensor<2x50x768xbf16> loc(#loc13)
    %23 = stablehlo.subtract %19, %22 : tensor<2x50x768xbf16> loc(#loc13)
    %24 = stablehlo.multiply %23, %23 : tensor<2x50x768xbf16> loc(#loc12)
    %25 = stablehlo.reduce(%24 init: %cst_7) applies stablehlo.add across dimensions = [2] : (tensor<2x50x768xbf16>, tensor<bf16>) -> tensor<2x50xbf16> loc(#loc12)
    %26 = stablehlo.multiply %25, %cst_4 : tensor<2x50xbf16> loc(#loc12)
    %27 = stablehlo.reshape %26 : (tensor<2x50xbf16>) -> tensor<2x50x1xbf16> loc(#loc12)
    %28 = stablehlo.add %27, %cst_3 : tensor<2x50x1xbf16> loc(#loc14)
    %29 = stablehlo.rsqrt %28 : tensor<2x50x1xbf16> loc(#loc15)
    %30 = stablehlo.reshape %29 : (tensor<2x50x1xbf16>) -> tensor<2x50xbf16> loc(#loc16)
    %31 = stablehlo.broadcast_in_dim %30, dims = [0, 1] : (tensor<2x50xbf16>) -> tensor<2x50x768xbf16> loc(#loc16)
    %32 = stablehlo.multiply %23, %31 : tensor<2x50x768xbf16> loc(#loc16)
    %33 = stablehlo.reshape %arg148 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %34 = stablehlo.custom_call @tt.mark_argument(%33) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_pre_layrnorm_weight"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %35 = stablehlo.reshape %34 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %36 = stablehlo.broadcast_in_dim %35, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc16)
    %37 = stablehlo.multiply %32, %36 : tensor<2x50x768xbf16> loc(#loc16)
    %38 = stablehlo.reshape %arg147 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %39 = stablehlo.custom_call @tt.mark_argument(%38) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_pre_layrnorm_bias"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %40 = stablehlo.reshape %39 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %41 = stablehlo.broadcast_in_dim %40, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc14)
    %42 = stablehlo.add %37, %41 : tensor<2x50x768xbf16> loc(#loc14)
    %43 = stablehlo.reduce(%42 init: %cst_7) applies stablehlo.add across dimensions = [2] : (tensor<2x50x768xbf16>, tensor<bf16>) -> tensor<2x50xbf16> loc(#loc17)
    %44 = stablehlo.multiply %43, %cst_4 : tensor<2x50xbf16> loc(#loc17)
    %45 = stablehlo.broadcast_in_dim %44, dims = [0, 1] : (tensor<2x50xbf16>) -> tensor<2x50x768xbf16> loc(#loc18)
    %46 = stablehlo.subtract %42, %45 : tensor<2x50x768xbf16> loc(#loc18)
    %47 = stablehlo.multiply %46, %46 : tensor<2x50x768xbf16> loc(#loc17)
    %48 = stablehlo.reduce(%47 init: %cst_7) applies stablehlo.add across dimensions = [2] : (tensor<2x50x768xbf16>, tensor<bf16>) -> tensor<2x50xbf16> loc(#loc17)
    %49 = stablehlo.multiply %48, %cst_4 : tensor<2x50xbf16> loc(#loc17)
    %50 = stablehlo.reshape %49 : (tensor<2x50xbf16>) -> tensor<2x50x1xbf16> loc(#loc17)
    %51 = stablehlo.add %50, %cst_3 : tensor<2x50x1xbf16> loc(#loc19)
    %52 = stablehlo.rsqrt %51 : tensor<2x50x1xbf16> loc(#loc20)
    %53 = stablehlo.reshape %52 : (tensor<2x50x1xbf16>) -> tensor<2x50xbf16> loc(#loc21)
    %54 = stablehlo.broadcast_in_dim %53, dims = [0, 1] : (tensor<2x50xbf16>) -> tensor<2x50x768xbf16> loc(#loc21)
    %55 = stablehlo.multiply %46, %54 : tensor<2x50x768xbf16> loc(#loc21)
    %56 = stablehlo.reshape %arg146 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %57 = stablehlo.custom_call @tt.mark_argument(%56) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_layer_norm1_weight"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %58 = stablehlo.reshape %57 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %59 = stablehlo.broadcast_in_dim %58, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc21)
    %60 = stablehlo.multiply %55, %59 : tensor<2x50x768xbf16> loc(#loc21)
    %61 = stablehlo.reshape %arg145 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %62 = stablehlo.custom_call @tt.mark_argument(%61) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_layer_norm1_bias"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %63 = stablehlo.reshape %62 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %64 = stablehlo.broadcast_in_dim %63, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc19)
    %65 = stablehlo.add %60, %64 : tensor<2x50x768xbf16> loc(#loc19)
    %66 = stablehlo.reshape %65 : (tensor<2x50x768xbf16>) -> tensor<100x768xbf16> loc(#loc22)
    %67 = stablehlo.reshape %arg157 : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc2)
    %68 = stablehlo.custom_call @tt.mark_argument(%67) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_self_attn_q_proj_weight"}} : (tensor<1x768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc3)
    %69 = stablehlo.reshape %68 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16> loc(#loc2)
    %70 = stablehlo.transpose %69, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[768,768]{0,1}"} : (tensor<768x768xbf16>) -> tensor<768x768xbf16> loc(#loc23)
    %71 = stablehlo.dot_general %66, %70, contracting_dims = [1] x [0] : (tensor<100x768xbf16>, tensor<768x768xbf16>) -> tensor<100x768xbf16> loc(#loc24)
    %72 = stablehlo.reshape %71 : (tensor<100x768xbf16>) -> tensor<2x50x768xbf16> loc(#loc22)
    %73 = stablehlo.reshape %arg156 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %74 = stablehlo.custom_call @tt.mark_argument(%73) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_self_attn_q_proj_bias"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %75 = stablehlo.reshape %74 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %76 = stablehlo.broadcast_in_dim %75, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc25)
    %77 = stablehlo.add %72, %76 : tensor<2x50x768xbf16> loc(#loc25)
    %78 = stablehlo.reshape %77 : (tensor<2x50x768xbf16>) -> tensor<2x50x12x64xbf16> loc(#loc26)
    %79 = stablehlo.transpose %78, dims = [0, 2, 1, 3] {result_layout = dense<[3, 1, 2, 0]> : tensor<4xindex>, xla_shape = "bf16[2,12,50,64]{3,1,2,0}"} : (tensor<2x50x12x64xbf16>) -> tensor<2x12x50x64xbf16> loc(#loc27)
    %80 = stablehlo.reshape %79 : (tensor<2x12x50x64xbf16>) -> tensor<24x50x64xbf16> loc(#loc28)
    %81 = stablehlo.reshape %arg155 : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc2)
    %82 = stablehlo.custom_call @tt.mark_argument(%81) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_self_attn_k_proj_weight"}} : (tensor<1x768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc3)
    %83 = stablehlo.reshape %82 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16> loc(#loc2)
    %84 = stablehlo.transpose %83, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[768,768]{0,1}"} : (tensor<768x768xbf16>) -> tensor<768x768xbf16> loc(#loc29)
    %85 = stablehlo.dot_general %66, %84, contracting_dims = [1] x [0] : (tensor<100x768xbf16>, tensor<768x768xbf16>) -> tensor<100x768xbf16> loc(#loc30)
    %86 = stablehlo.reshape %85 : (tensor<100x768xbf16>) -> tensor<2x50x768xbf16> loc(#loc31)
    %87 = stablehlo.reshape %arg154 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %88 = stablehlo.custom_call @tt.mark_argument(%87) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_self_attn_k_proj_bias"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %89 = stablehlo.reshape %88 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %90 = stablehlo.broadcast_in_dim %89, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc32)
    %91 = stablehlo.add %86, %90 : tensor<2x50x768xbf16> loc(#loc32)
    %92 = stablehlo.reshape %91 : (tensor<2x50x768xbf16>) -> tensor<2x50x12x64xbf16> loc(#loc33)
    %93 = stablehlo.transpose %92, dims = [0, 2, 3, 1] : (tensor<2x50x12x64xbf16>) -> tensor<2x12x64x50xbf16> loc(#loc34)
    %94 = stablehlo.reshape %93 : (tensor<2x12x64x50xbf16>) -> tensor<24x64x50xbf16> loc(#loc28)
    %95 = stablehlo.dot_general %80, %94, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<24x50x64xbf16>, tensor<24x64x50xbf16>) -> tensor<24x50x50xbf16> loc(#loc35)
    %96 = stablehlo.reshape %95 : (tensor<24x50x50xbf16>) -> tensor<2x12x50x50xbf16> loc(#loc28)
    %97 = stablehlo.multiply %96, %cst_2 : tensor<2x12x50x50xbf16> loc(#loc36)
    %98 = stablehlo.convert %97 : (tensor<2x12x50x50xbf16>) -> tensor<2x12x50x50xf32> loc(#loc37)
    %99 = stablehlo.reduce(%98 init: %cst_6) applies stablehlo.maximum across dimensions = [3] : (tensor<2x12x50x50xf32>, tensor<f32>) -> tensor<2x12x50xf32> loc(#loc38)
    %100 = stablehlo.broadcast_in_dim %99, dims = [0, 1, 2] : (tensor<2x12x50xf32>) -> tensor<2x12x50x50xf32> loc(#loc38)
    %101 = stablehlo.subtract %98, %100 : tensor<2x12x50x50xf32> loc(#loc38)
    %102 = stablehlo.exponential %101 : tensor<2x12x50x50xf32> loc(#loc38)
    %103 = stablehlo.reduce(%102 init: %cst_5) applies stablehlo.add across dimensions = [3] : (tensor<2x12x50x50xf32>, tensor<f32>) -> tensor<2x12x50xf32> loc(#loc38)
    %104 = stablehlo.broadcast_in_dim %103, dims = [0, 1, 2] : (tensor<2x12x50xf32>) -> tensor<2x12x50x50xf32> loc(#loc38)
    %105 = stablehlo.divide %102, %104 : tensor<2x12x50x50xf32> loc(#loc38)
    %106 = stablehlo.convert %105 : (tensor<2x12x50x50xf32>) -> tensor<2x12x50x50xbf16> loc(#loc39)
    %107 = stablehlo.reshape %106 : (tensor<2x12x50x50xbf16>) -> tensor<24x50x50xbf16> loc(#loc40)
    %108 = stablehlo.reshape %arg144 : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc2)
    %109 = stablehlo.custom_call @tt.mark_argument(%108) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_self_attn_v_proj_weight"}} : (tensor<1x768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc3)
    %110 = stablehlo.reshape %109 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16> loc(#loc2)
    %111 = stablehlo.transpose %110, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[768,768]{0,1}"} : (tensor<768x768xbf16>) -> tensor<768x768xbf16> loc(#loc41)
    %112 = stablehlo.dot_general %66, %111, contracting_dims = [1] x [0] : (tensor<100x768xbf16>, tensor<768x768xbf16>) -> tensor<100x768xbf16> loc(#loc42)
    %113 = stablehlo.reshape %112 : (tensor<100x768xbf16>) -> tensor<2x50x768xbf16> loc(#loc43)
    %114 = stablehlo.reshape %arg143 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %115 = stablehlo.custom_call @tt.mark_argument(%114) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_self_attn_v_proj_bias"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %116 = stablehlo.reshape %115 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %117 = stablehlo.broadcast_in_dim %116, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc44)
    %118 = stablehlo.add %113, %117 : tensor<2x50x768xbf16> loc(#loc44)
    %119 = stablehlo.reshape %118 : (tensor<2x50x768xbf16>) -> tensor<2x50x12x64xbf16> loc(#loc45)
    %120 = stablehlo.transpose %119, dims = [0, 2, 1, 3] {result_layout = dense<[3, 1, 2, 0]> : tensor<4xindex>, xla_shape = "bf16[2,12,50,64]{3,1,2,0}"} : (tensor<2x50x12x64xbf16>) -> tensor<2x12x50x64xbf16> loc(#loc46)
    %121 = stablehlo.reshape %120 : (tensor<2x12x50x64xbf16>) -> tensor<24x50x64xbf16> loc(#loc40)
    %122 = stablehlo.dot_general %107, %121, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<24x50x50xbf16>, tensor<24x50x64xbf16>) -> tensor<24x50x64xbf16> loc(#loc47)
    %123 = stablehlo.reshape %122 : (tensor<24x50x64xbf16>) -> tensor<2x12x50x64xbf16> loc(#loc40)
    %124 = stablehlo.transpose %123, dims = [0, 2, 1, 3] {result_layout = dense<[3, 1, 2, 0]> : tensor<4xindex>, xla_shape = "bf16[2,50,12,64]{3,1,2,0}"} : (tensor<2x12x50x64xbf16>) -> tensor<2x50x12x64xbf16> loc(#loc48)
    %125 = stablehlo.reshape %124 : (tensor<2x50x12x64xbf16>) -> tensor<100x768xbf16> loc(#loc49)
    %126 = stablehlo.reshape %arg142 : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc2)
    %127 = stablehlo.custom_call @tt.mark_argument(%126) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_self_attn_out_proj_weight"}} : (tensor<1x768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc3)
    %128 = stablehlo.reshape %127 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16> loc(#loc2)
    %129 = stablehlo.transpose %128, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[768,768]{0,1}"} : (tensor<768x768xbf16>) -> tensor<768x768xbf16> loc(#loc50)
    %130 = stablehlo.dot_general %125, %129, contracting_dims = [1] x [0] : (tensor<100x768xbf16>, tensor<768x768xbf16>) -> tensor<100x768xbf16> loc(#loc51)
    %131 = stablehlo.reshape %130 : (tensor<100x768xbf16>) -> tensor<2x50x768xbf16> loc(#loc49)
    %132 = stablehlo.reshape %arg141 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %133 = stablehlo.custom_call @tt.mark_argument(%132) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_self_attn_out_proj_bias"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %134 = stablehlo.reshape %133 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %135 = stablehlo.broadcast_in_dim %134, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc52)
    %136 = stablehlo.add %131, %135 : tensor<2x50x768xbf16> loc(#loc52)
    %137 = stablehlo.add %42, %136 : tensor<2x50x768xbf16> loc(#loc53)
    %138 = stablehlo.reduce(%137 init: %cst_7) applies stablehlo.add across dimensions = [2] : (tensor<2x50x768xbf16>, tensor<bf16>) -> tensor<2x50xbf16> loc(#loc54)
    %139 = stablehlo.multiply %138, %cst_4 : tensor<2x50xbf16> loc(#loc54)
    %140 = stablehlo.broadcast_in_dim %139, dims = [0, 1] : (tensor<2x50xbf16>) -> tensor<2x50x768xbf16> loc(#loc55)
    %141 = stablehlo.subtract %137, %140 : tensor<2x50x768xbf16> loc(#loc55)
    %142 = stablehlo.multiply %141, %141 : tensor<2x50x768xbf16> loc(#loc54)
    %143 = stablehlo.reduce(%142 init: %cst_7) applies stablehlo.add across dimensions = [2] : (tensor<2x50x768xbf16>, tensor<bf16>) -> tensor<2x50xbf16> loc(#loc54)
    %144 = stablehlo.multiply %143, %cst_4 : tensor<2x50xbf16> loc(#loc54)
    %145 = stablehlo.reshape %144 : (tensor<2x50xbf16>) -> tensor<2x50x1xbf16> loc(#loc54)
    %146 = stablehlo.add %145, %cst_3 : tensor<2x50x1xbf16> loc(#loc56)
    %147 = stablehlo.rsqrt %146 : tensor<2x50x1xbf16> loc(#loc57)
    %148 = stablehlo.reshape %147 : (tensor<2x50x1xbf16>) -> tensor<2x50xbf16> loc(#loc58)
    %149 = stablehlo.broadcast_in_dim %148, dims = [0, 1] : (tensor<2x50xbf16>) -> tensor<2x50x768xbf16> loc(#loc58)
    %150 = stablehlo.multiply %141, %149 : tensor<2x50x768xbf16> loc(#loc58)
    %151 = stablehlo.reshape %arg140 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %152 = stablehlo.custom_call @tt.mark_argument(%151) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_layer_norm2_weight"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %153 = stablehlo.reshape %152 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %154 = stablehlo.broadcast_in_dim %153, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc58)
    %155 = stablehlo.multiply %150, %154 : tensor<2x50x768xbf16> loc(#loc58)
    %156 = stablehlo.reshape %arg139 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %157 = stablehlo.custom_call @tt.mark_argument(%156) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_layer_norm2_bias"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %158 = stablehlo.reshape %157 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %159 = stablehlo.broadcast_in_dim %158, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc56)
    %160 = stablehlo.add %155, %159 : tensor<2x50x768xbf16> loc(#loc56)
    %161 = stablehlo.reshape %160 : (tensor<2x50x768xbf16>) -> tensor<100x768xbf16> loc(#loc59)
    %162 = stablehlo.reshape %arg138 : (tensor<3072x768xbf16>) -> tensor<1x3072x768xbf16> loc(#loc2)
    %163 = stablehlo.custom_call @tt.mark_argument(%162) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_mlp_fc1_weight"}} : (tensor<1x3072x768xbf16>) -> tensor<1x3072x768xbf16> loc(#loc3)
    %164 = stablehlo.reshape %163 : (tensor<1x3072x768xbf16>) -> tensor<3072x768xbf16> loc(#loc2)
    %165 = stablehlo.transpose %164, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[768,3072]{0,1}"} : (tensor<3072x768xbf16>) -> tensor<768x3072xbf16> loc(#loc60)
    %166 = stablehlo.dot_general %161, %165, contracting_dims = [1] x [0] : (tensor<100x768xbf16>, tensor<768x3072xbf16>) -> tensor<100x3072xbf16> loc(#loc61)
    %167 = stablehlo.reshape %166 : (tensor<100x3072xbf16>) -> tensor<2x50x3072xbf16> loc(#loc59)
    %168 = stablehlo.reshape %arg137 : (tensor<3072xbf16>) -> tensor<1x1x3072xbf16> loc(#loc2)
    %169 = stablehlo.custom_call @tt.mark_argument(%168) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_mlp_fc1_bias"}} : (tensor<1x1x3072xbf16>) -> tensor<1x1x3072xbf16> loc(#loc3)
    %170 = stablehlo.reshape %169 : (tensor<1x1x3072xbf16>) -> tensor<3072xbf16> loc(#loc2)
    %171 = stablehlo.broadcast_in_dim %170, dims = [2] : (tensor<3072xbf16>) -> tensor<2x50x3072xbf16> loc(#loc62)
    %172 = stablehlo.add %167, %171 : tensor<2x50x3072xbf16> loc(#loc62)
    %173 = stablehlo.multiply %172, %cst_1 : tensor<2x50x3072xbf16> loc(#loc63)
    %174 = stablehlo.logistic %173 : tensor<2x50x3072xbf16> loc(#loc64)
    %175 = stablehlo.multiply %172, %174 : tensor<2x50x3072xbf16> loc(#loc63)
    %176 = stablehlo.reshape %175 : (tensor<2x50x3072xbf16>) -> tensor<100x3072xbf16> loc(#loc65)
    %177 = stablehlo.reshape %arg136 : (tensor<768x3072xbf16>) -> tensor<1x768x3072xbf16> loc(#loc2)
    %178 = stablehlo.custom_call @tt.mark_argument(%177) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_mlp_fc2_weight"}} : (tensor<1x768x3072xbf16>) -> tensor<1x768x3072xbf16> loc(#loc3)
    %179 = stablehlo.reshape %178 : (tensor<1x768x3072xbf16>) -> tensor<768x3072xbf16> loc(#loc2)
    %180 = stablehlo.transpose %179, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[3072,768]{0,1}"} : (tensor<768x3072xbf16>) -> tensor<3072x768xbf16> loc(#loc66)
    %181 = stablehlo.dot_general %176, %180, contracting_dims = [1] x [0] : (tensor<100x3072xbf16>, tensor<3072x768xbf16>) -> tensor<100x768xbf16> loc(#loc67)
    %182 = stablehlo.reshape %181 : (tensor<100x768xbf16>) -> tensor<2x50x768xbf16> loc(#loc65)
    %183 = stablehlo.reshape %arg135 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %184 = stablehlo.custom_call @tt.mark_argument(%183) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_0_mlp_fc2_bias"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %185 = stablehlo.reshape %184 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %186 = stablehlo.broadcast_in_dim %185, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc68)
    %187 = stablehlo.add %182, %186 : tensor<2x50x768xbf16> loc(#loc68)
    %188 = stablehlo.add %137, %187 : tensor<2x50x768xbf16> loc(#loc69)
    %189 = stablehlo.reduce(%188 init: %cst_7) applies stablehlo.add across dimensions = [2] : (tensor<2x50x768xbf16>, tensor<bf16>) -> tensor<2x50xbf16> loc(#loc70)
    %190 = stablehlo.multiply %189, %cst_4 : tensor<2x50xbf16> loc(#loc70)
    %191 = stablehlo.broadcast_in_dim %190, dims = [0, 1] : (tensor<2x50xbf16>) -> tensor<2x50x768xbf16> loc(#loc71)
    %192 = stablehlo.subtract %188, %191 : tensor<2x50x768xbf16> loc(#loc71)
    %193 = stablehlo.multiply %192, %192 : tensor<2x50x768xbf16> loc(#loc70)
    %194 = stablehlo.reduce(%193 init: %cst_7) applies stablehlo.add across dimensions = [2] : (tensor<2x50x768xbf16>, tensor<bf16>) -> tensor<2x50xbf16> loc(#loc70)
    %195 = stablehlo.multiply %194, %cst_4 : tensor<2x50xbf16> loc(#loc70)
    %196 = stablehlo.reshape %195 : (tensor<2x50xbf16>) -> tensor<2x50x1xbf16> loc(#loc70)
    %197 = stablehlo.add %196, %cst_3 : tensor<2x50x1xbf16> loc(#loc72)
    %198 = stablehlo.rsqrt %197 : tensor<2x50x1xbf16> loc(#loc73)
    %199 = stablehlo.reshape %198 : (tensor<2x50x1xbf16>) -> tensor<2x50xbf16> loc(#loc74)
    %200 = stablehlo.broadcast_in_dim %199, dims = [0, 1] : (tensor<2x50xbf16>) -> tensor<2x50x768xbf16> loc(#loc74)
    %201 = stablehlo.multiply %192, %200 : tensor<2x50x768xbf16> loc(#loc74)
    %202 = stablehlo.reshape %arg134 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %203 = stablehlo.custom_call @tt.mark_argument(%202) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_1_layer_norm1_weight"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %204 = stablehlo.reshape %203 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %205 = stablehlo.broadcast_in_dim %204, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc74)
    %206 = stablehlo.multiply %201, %205 : tensor<2x50x768xbf16> loc(#loc74)
    %207 = stablehlo.reshape %arg133 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %208 = stablehlo.custom_call @tt.mark_argument(%207) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_1_layer_norm1_bias"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %209 = stablehlo.reshape %208 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %210 = stablehlo.broadcast_in_dim %209, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc72)
    %211 = stablehlo.add %206, %210 : tensor<2x50x768xbf16> loc(#loc72)
    %212 = stablehlo.reshape %211 : (tensor<2x50x768xbf16>) -> tensor<100x768xbf16> loc(#loc75)
    %213 = stablehlo.reshape %arg161 : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc2)
    %214 = stablehlo.custom_call @tt.mark_argument(%213) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_1_self_attn_q_proj_weight"}} : (tensor<1x768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc3)
    %215 = stablehlo.reshape %214 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16> loc(#loc2)
    %216 = stablehlo.transpose %215, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[768,768]{0,1}"} : (tensor<768x768xbf16>) -> tensor<768x768xbf16> loc(#loc76)
    %217 = stablehlo.dot_general %212, %216, contracting_dims = [1] x [0] : (tensor<100x768xbf16>, tensor<768x768xbf16>) -> tensor<100x768xbf16> loc(#loc77)
    %218 = stablehlo.reshape %217 : (tensor<100x768xbf16>) -> tensor<2x50x768xbf16> loc(#loc75)
    %219 = stablehlo.reshape %arg160 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %220 = stablehlo.custom_call @tt.mark_argument(%219) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_1_self_attn_q_proj_bias"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %221 = stablehlo.reshape %220 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %222 = stablehlo.broadcast_in_dim %221, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc78)
    %223 = stablehlo.add %218, %222 : tensor<2x50x768xbf16> loc(#loc78)
    %224 = stablehlo.reshape %223 : (tensor<2x50x768xbf16>) -> tensor<2x50x12x64xbf16> loc(#loc79)
    %225 = stablehlo.transpose %224, dims = [0, 2, 1, 3] {result_layout = dense<[3, 1, 2, 0]> : tensor<4xindex>, xla_shape = "bf16[2,12,50,64]{3,1,2,0}"} : (tensor<2x50x12x64xbf16>) -> tensor<2x12x50x64xbf16> loc(#loc80)
    %226 = stablehlo.reshape %225 : (tensor<2x12x50x64xbf16>) -> tensor<24x50x64xbf16> loc(#loc81)
    %227 = stablehlo.reshape %arg159 : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc2)
    %228 = stablehlo.custom_call @tt.mark_argument(%227) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_1_self_attn_k_proj_weight"}} : (tensor<1x768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc3)
    %229 = stablehlo.reshape %228 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16> loc(#loc2)
    %230 = stablehlo.transpose %229, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[768,768]{0,1}"} : (tensor<768x768xbf16>) -> tensor<768x768xbf16> loc(#loc82)
    %231 = stablehlo.dot_general %212, %230, contracting_dims = [1] x [0] : (tensor<100x768xbf16>, tensor<768x768xbf16>) -> tensor<100x768xbf16> loc(#loc83)
    %232 = stablehlo.reshape %231 : (tensor<100x768xbf16>) -> tensor<2x50x768xbf16> loc(#loc84)
    %233 = stablehlo.reshape %arg158 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc2)
    %234 = stablehlo.custom_call @tt.mark_argument(%233) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_1_self_attn_k_proj_bias"}} : (tensor<1x1x768xbf16>) -> tensor<1x1x768xbf16> loc(#loc3)
    %235 = stablehlo.reshape %234 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc2)
    %236 = stablehlo.broadcast_in_dim %235, dims = [2] : (tensor<768xbf16>) -> tensor<2x50x768xbf16> loc(#loc85)
    %237 = stablehlo.add %232, %236 : tensor<2x50x768xbf16> loc(#loc85)
    %238 = stablehlo.reshape %237 : (tensor<2x50x768xbf16>) -> tensor<2x50x12x64xbf16> loc(#loc86)
    %239 = stablehlo.transpose %238, dims = [0, 2, 3, 1] : (tensor<2x50x12x64xbf16>) -> tensor<2x12x64x50xbf16> loc(#loc87)
    %240 = stablehlo.reshape %239 : (tensor<2x12x64x50xbf16>) -> tensor<24x64x50xbf16> loc(#loc81)
    %241 = stablehlo.dot_general %226, %240, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<24x50x64xbf16>, tensor<24x64x50xbf16>) -> tensor<24x50x50xbf16> loc(#loc88)
    %242 = stablehlo.reshape %241 : (tensor<24x50x50xbf16>) -> tensor<2x12x50x50xbf16> loc(#loc81)
    %243 = stablehlo.multiply %242, %cst_2 : tensor<2x12x50x50xbf16> loc(#loc89)
    %244 = stablehlo.convert %243 : (tensor<2x12x50x50xbf16>) -> tensor<2x12x50x50xf32> loc(#loc90)
    %245 = stablehlo.reduce(%244 init: %cst_6) applies stablehlo.maximum across dimensions = [3] : (tensor<2x12x50x50xf32>, tensor<f32>) -> tensor<2x12x50xf32> loc(#loc91)
    %246 = stablehlo.broadcast_in_dim %245, dims = [0, 1, 2] : (tensor<2x12x50xf32>) -> tensor<2x12x50x50xf32> loc(#loc91)
    %247 = stablehlo.subtract %244, %246 : tensor<2x12x50x50xf32> loc(#loc91)
    %248 = stablehlo.exponential %247 : tensor<2x12x50x50xf32> loc(#loc91)
    %249 = stablehlo.reduce(%248 init: %cst_5) applies stablehlo.add across dimensions = [3] : (tensor<2x12x50x50xf32>, tensor<f32>) -> tensor<2x12x50xf32> loc(#loc91)
    %250 = stablehlo.broadcast_in_dim %249, dims = [0, 1, 2] : (tensor<2x12x50xf32>) -> tensor<2x12x50x50xf32> loc(#loc91)
    %251 = stablehlo.divide %248, %250 : tensor<2x12x50x50xf32> loc(#loc91)
    %252 = stablehlo.convert %251 : (tensor<2x12x50x50xf32>) -> tensor<2x12x50x50xbf16> loc(#loc92)
    %253 = stablehlo.reshape %252 : (tensor<2x12x50x50xbf16>) -> tensor<24x50x50xbf16> loc(#loc93)
    %254 = stablehlo.reshape %arg132 : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc2)
    %255 = stablehlo.custom_call @tt.mark_argument(%254) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___vision_model_encoder_layers_1_self_attn_v_proj_weight"}} : (tensor<1x768x768xbf16>) -> tensor<1x768x768xbf16> loc(#loc3)
    %256 = stablehlo.reshape %255 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16> loc(#loc2)
    %257 = stablehlo.transpose %256, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[768,768]{0,1}"} : (tensor<768x768xbf16>) -> tensor<768x768xbf16> loc(#loc94)
    %258 = stablehlo.dot_general %212, %257, contracting_dims = [1] x [0] : (tensor<100x768xbf16>, tensor<768x768xbf16>) -> tensor<100x768xbf16> loc(#loc95)
    %259 = stablehlo.reshape %258 : (tensor<100x768xbf16>) -> tensor<2x50x768xbf16> loc(#loc96)
